#### Execute Method

---

|  |
| --- |
| ITransientElementMaker Interface   See Also |

Implement this method to create transient elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` void Execute() ``` |

| Visual Basic |
| --- |
| ``` Sub Execute ``` |

| Visual C++ |
| --- |
| ``` void Execute() ``` |

# See Also

ITransientElementMaker Interface

Autodesk.Revit.DB Namespace

#### ElectricalLighting Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Electrical - Lighting"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ElectricalLighting { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElectricalLighting As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ElectricalLighting { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### YOffset Property

---

|  |
| --- |
| FamilySymbolProfile Class   See Also |

The offset of the profile to the origin of the sketch plane in the Y direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double YOffset { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property YOffset As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double YOffset { 	double get (); 	void set (double value); } ``` |

# See Also

FamilySymbolProfile Class

Autodesk.Revit.DB Namespace

#### GetCoordinatePlaneReferenceXZ Method

---

|  |
| --- |
| ReferencePoint Class   See Also |

A reference for the XZ plane of the coordinate system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Reference GetCoordinatePlaneReferenceXZ() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCoordinatePlaneReferenceXZ As Reference ``` |

| Visual C++ |
| --- |
| ``` public: Reference^ GetCoordinatePlaneReferenceXZ() ``` |

# See Also

ReferencePoint Class

Autodesk.Revit.DB Namespace

#### GetSubscriptStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are subscripted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public FormatStatus GetSubscriptStatus() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSubscriptStatus As FormatStatus ``` |

| Visual C++ |
| --- |
| ``` public: FormatStatus GetSubscriptStatus() ``` |

#### Return Value

The format status of subscript on characters  FormatStatus  .

# Remarks

This function only returns  All  or  None  if the entire text contains one character.

# See Also

FormattedText Class

GetSubscriptStatus Overload

Autodesk.Revit.DB Namespace

#### Equality Operator

---

|  |
| --- |
| ScheduleFieldId Class   See Also |

Determines whether two ScheduleFieldIds are the same.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool operator ==( 	ScheduleFieldId first, 	ScheduleFieldId second ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Operator = ( _ 	first As ScheduleFieldId, _ 	second As ScheduleFieldId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool operator ==( 	ScheduleFieldId^ first,  	ScheduleFieldId^ second ) ``` |

#### Parameters

first
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The first ScheduleFieldId.

second
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The second ScheduleFieldId.

#### Return Value

True if the ScheduleFieldIds are the same, otherwise false.

# See Also

ScheduleFieldId Class

Autodesk.Revit.DB Namespace

#### DimLeader Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Leader"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimLeader { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimLeader As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimLeader { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PipeFittingAndAccessoryPressureDropUIService Property

---

|  |
| --- |
| ExternalServices BuiltInExternalServices Class   See Also |

The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from  IPipeFittingAndAccessoryPressureDropUIServer  .

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalServiceId PipeFittingAndAccessoryPressureDropUIService { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropUIService As ExternalServiceId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalServiceId^ PipeFittingAndAccessoryPressureDropUIService { 	ExternalServiceId^ get (); } ``` |

# See Also

ExternalServices BuiltInExternalServices Class

Autodesk.Revit.DB.ExternalService Namespace

#### InsertColumnViewError Property

---

|  |
| --- |
| BuiltInFailures ViewFailures Class   See Also |

Column cannot be placed in Elevation or Section view

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InsertColumnViewError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InsertColumnViewError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InsertColumnViewError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ViewFailures Class

Autodesk.Revit.DB Namespace

#### TileChangeColumn Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "Amount" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TileChangeColumn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TileChangeColumn As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TileChangeColumn { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 5".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### NumberSystemTagType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Tag Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NumberSystemTagType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NumberSystemTagType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NumberSystemTagType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RectMullionWidth1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Width on side 1"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RectMullionWidth1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RectMullionWidth1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RectMullionWidth1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsDistributionsysVlgParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Line to Ground Voltage"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsDistributionsysVlgParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsDistributionsysVlgParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsDistributionsysVlgParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotDrawRoofWall Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Can't make roof.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotDrawRoofWall { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotDrawRoofWall As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotDrawRoofWall { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### IsLateAddinLoading Property

---

|  |
| --- |
| UIControlledApplication Class   See Also |

Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsLateAddinLoading { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsLateAddinLoading As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsLateAddinLoading { 	bool get (); } ``` |

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace

#### IsCyclical Property

---

|  |
| --- |
| DividedPath Class   See Also |

True if the first and last point coincide False otherwise.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsCyclical { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsCyclical As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsCyclical { 	bool get (); } ``` |

# See Also

DividedPath Class

Autodesk.Revit.DB Namespace

#### RemoveAssociation Method

---

|  |
| --- |
| AnalyticalToPhysicalAssociationManager Class   See Also |

This method will remove the association for the element with the given ElementId.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public void RemoveAssociation( 	ElementId id ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveAssociation ( _ 	id As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveAssociation( 	ElementId^ id ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.DB ElementId
     Id of the element for which we want to remove the association.

# Remarks

If the id does not have any association, an exception is thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This element doesn't have an association defined. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AnalyticalToPhysicalAssociationManager Class

Autodesk.Revit.DB.Structure Namespace

#### CannotCreateReveal Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Could not create Reveal. [Description]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateReveal { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateReveal As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateReveal { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### ArrowheadType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Arrowhead Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ArrowheadType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ArrowheadType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ArrowheadType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CurveByPointsArray Class

---

|  |
| --- |
| Members   See Also |

An array that can contain CurveByPoints elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class CurveByPointsArray : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class CurveByPointsArray _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class CurveByPointsArray : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB CurveByPointsArray

# See Also

CurveByPointsArray Members

Autodesk.Revit.DB Namespace

#### GetSequence Method

---

|  |
| --- |
| AlphanumericRevisionSettings Class   See Also |

Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public IList<string> GetSequence() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSequence As IList(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: IList<String^>^ GetSequence() ``` |

# See Also

AlphanumericRevisionSettings Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| TableCellStyle Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

TableCellStyle Class

Autodesk.Revit.DB Namespace

#### SpecificHeat Property

---

|  |
| --- |
| ThermalAsset Class   See Also |

The specific heat of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double SpecificHeat { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SpecificHeat As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double SpecificHeat { 	double get (); 	void set (double value); } ``` |

# Remarks

Values are in squared-feet per Kelvin, squared-second (ftÂ²/(K Â· sÂ²)) and must be non-negative.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for specificHeat must be non-negative. |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace

#### PipeFittingAndAccessoryData Class

---

|  |
| --- |
| Members   See Also |

The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class PipeFittingAndAccessoryData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class PipeFittingAndAccessoryData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class PipeFittingAndAccessoryData : IDisposable ``` |

# Remarks

A FamilyInstance is the input data for the calculation, and the result is coefficient for each connector.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Plumbing PipeFittingAndAccessoryData

# See Also

PipeFittingAndAccessoryData Members

Autodesk.Revit.DB.Plumbing Namespace

#### AutoMullionBorder2Horiz Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Border 2 Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AutoMullionBorder2Horiz { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AutoMullionBorder2Horiz As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AutoMullionBorder2Horiz { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| AddInId Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

AddInId Class

Autodesk.Revit.DB Namespace

#### GetCurrent Method

---

|  |
| --- |
| FilteredElementIterator Class   See Also |

The current element found by the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public Element GetCurrent() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCurrent As Element ``` |

| Visual C++ |
| --- |
| ``` public: Element^ GetCurrent() ``` |

#### Return Value

The element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | There are no more element ids in the iterator. -or- The FilteredElementCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. -or- The iterator cannot proceed due to changes made to the Element table in Revit's database (typically, This can be the result of an Element deletion). |

# See Also

FilteredElementIterator Class

Autodesk.Revit.DB Namespace

#### AppearanceAssetEditScope Constructor

---

|  |
| --- |
| AppearanceAssetEditScope Class   See Also |

Constructs a new instance of an AppearanceAssetEditScope.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public AppearanceAssetEditScope( 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	document As Document _ ) ``` |

| Visual C++ |
| --- |
| ``` public: AppearanceAssetEditScope( 	Document^ document ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document for which this EditScope is going to be used.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AppearanceAssetEditScope Class

Autodesk.Revit.DB.Visual Namespace

#### GetRodAttachedElementId Method

---

|  |
| --- |
| FabricationRodInfo Class   See Also |

Gets the id of the attached component for the specified rod.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public LinkElementId GetRodAttachedElementId( 	int rodIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRodAttachedElementId ( _ 	rodIndex As Integer _ ) As LinkElementId ``` |

| Visual C++ |
| --- |
| ``` public: LinkElementId^ GetRodAttachedElementId( 	int rodIndex ) ``` |

#### Parameters

rodIndex
:   Type:  System Int32
     The index of the specified rod.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |
| Autodesk.Revit.Exceptions InvalidOperationException | The rods do not attached to any structue. |

# See Also

FabricationRodInfo Class

Autodesk.Revit.DB Namespace

#### FlangeFillet Property

---

|  |
| --- |
| StructuralSectionGeneralW Class   See Also |

Flange Fillet - fillet radius at the flange end.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double FlangeFillet { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FlangeFillet As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double FlangeFillet { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionGeneralW Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### VectorPosition Property

---

|  |
| --- |
| AnalysisDisplayVectorSettings Class   See Also |

Vector position.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayStyleVectorPosition VectorPosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property VectorPosition As AnalysisDisplayStyleVectorPosition 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property AnalysisDisplayStyleVectorPosition VectorPosition { 	AnalysisDisplayStyleVectorPosition get (); 	void set (AnalysisDisplayStyleVectorPosition value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

AnalysisDisplayVectorSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### VerticalAlignmentStyle Enumeration

---

|  |
| --- |
| See Also |

Declares the vertical alignment style of font.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum VerticalAlignmentStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration VerticalAlignmentStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class VerticalAlignmentStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Top | Alignment to top |
| Middle | Alignment to middle |
| Bottom | Alignment to bottom |

# See Also

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| MacroManagerIterator Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

MacroManagerIterator Class

Autodesk.Revit.DB.Macros Namespace

#### AnalyticalSupportCycleWarning Property

---

|  |
| --- |
| BuiltInFailures AnalyticalModelFailures Class   See Also |

Circular support chain detected

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AnalyticalSupportCycleWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalSupportCycleWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AnalyticalSupportCycleWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AnalyticalModelFailures Class

Autodesk.Revit.DB Namespace

#### TabBehind Property

---

|  |
| --- |
| DockablePaneState Class   See Also |

Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public DockablePaneId TabBehind { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TabBehind As DockablePaneId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property DockablePaneId^ TabBehind { 	DockablePaneId^ get (); 	void set (DockablePaneId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: no dockable pane has been registered with identifier tabBehind. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

DockablePaneState Class

Autodesk.Revit.UI Namespace

#### SweepTrajSegmented Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Trajectory Segmentation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SweepTrajSegmented { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SweepTrajSegmented As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SweepTrajSegmented { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.LevelAssociationFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about Level association of Analytical Node.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static class LevelAssociationFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class LevelAssociationFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class LevelAssociationFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures LevelAssociationFailures

# See Also

BuiltInFailures LevelAssociationFailures Members

Autodesk.Revit.DB Namespace

#### GetRefGridLines Method

---

|  |
| --- |
| Panel Class   See Also |

This method is used to get the reference gridlines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void GetRefGridLines( 	ref ElementId uGridLineId, 	ref ElementId vGridLineId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub GetRefGridLines ( _ 	ByRef uGridLineId As ElementId, _ 	ByRef vGridLineId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void GetRefGridLines( 	ElementId^% uGridLineId,  	ElementId^% vGridLineId ) ``` |

#### Parameters

uGridLineId
:   Type:  Autodesk.Revit.DB ElementId   %

vGridLineId
:   Type:  Autodesk.Revit.DB ElementId   %

# See Also

Panel Class

Autodesk.Revit.DB Namespace

#### RevitLinkOptions Class

---

|  |
| --- |
| Members   See Also |

This class contains the options in use when creating or loading a Revit link.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class RevitLinkOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class RevitLinkOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class RevitLinkOptions : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB RevitLinkOptions

# See Also

RevitLinkOptions Members

Autodesk.Revit.DB Namespace

#### InstanceLengthParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId InstanceLengthParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InstanceLengthParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ InstanceLengthParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HostId Property

---

|  |
| --- |
| SiteSubRegion Class   See Also |

The element id of the topography surface hosting this SiteSubRegion.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ElementId HostId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HostId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ HostId { 	ElementId^ get (); } ``` |

# See Also

SiteSubRegion Class

Autodesk.Revit.DB.Architecture Namespace

#### AddWallSweep Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

Adds a new wall sweep or reveal to the compound structure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void AddWallSweep( 	WallSweepInfo wallSweepInfo ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddWallSweep ( _ 	wallSweepInfo As WallSweepInfo _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddWallSweep( 	WallSweepInfo^ wallSweepInfo ) ``` |

#### Parameters

wallSweepInfo
:   Type:  Autodesk.Revit.DB WallSweepInfo
     The wall sweep info to create a wall sweep.

# Remarks

A wall sweep is an object that is created by sweeping a closed 2d profile along a horizontal line that is positioned on one side (exterior or interior) of the hosting wall. A reveal is a special wall sweep with a void shape that is subtracted from the hosting wall.

The id field of the WallSweepInfo must be populated with a non-negative integer value. If there already is a sweep defined for this id, its parameters will be changed. A new sweep will be created if no existing one has matching id.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The wall sweep info does not represent a fixed wall sweep. Only fixed wall sweeps may be assigned to vertical compound structures. -or- The WallSweepInfo has an invalid id for a fixed wall sweep. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This operation is valid only for vertically compound structures. |

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### RebarHookOverEndTreatment Property

---

|  |
| --- |
| BuiltInFailures RebarFailures Class   See Also |

Cannot set hook at an end that has end treatment.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RebarHookOverEndTreatment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarHookOverEndTreatment As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RebarHookOverEndTreatment { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarFailures Class

Autodesk.Revit.DB Namespace

#### MultipleDominatingMullions Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Multiple dominating mullions on a grid face may cause ambiguous automatic adjustment of margins.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MultipleDominatingMullions { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MultipleDominatingMullions As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MultipleDominatingMullions { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### ViewerSheetNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Sheet Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewerSheetNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewerSheetNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewerSheetNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LinkInstanceId Property

---

|  |
| --- |
| LinkElementId Class   See Also |

The id of the link, or invalidElementId if no link.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId LinkInstanceId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LinkInstanceId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ LinkInstanceId { 	ElementId^ get (); } ``` |

# See Also

LinkElementId Class

Autodesk.Revit.DB Namespace

#### HasCurrent Method

---

|  |
| --- |
| ConduitSizeIterator Class   See Also |

Identifies if the iterator has a current item.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool HasCurrent() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasCurrent As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasCurrent() ``` |

#### Return Value

True if there is a current item.

# Remarks

There is no current item if the iterator has not started yet or has been done.

# See Also

ConduitSizeIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### Link Method (String, DWFImportOptions)

---

|  |
| --- |
| Document Class   See Also |

Links Markups in a DWF file into the project document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<ElementId> Link( 	string file, 	DWFImportOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Link ( _ 	file As String, _ 	options As DWFImportOptions _ ) As IList(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ElementId^>^ Link( 	String^ file,  	DWFImportOptions^ options ) ``` |

#### Parameters

file
:   Type:  System String
     Full path of the file to link. File must exist and must be a valid DWF file.

options
:   Type:  Autodesk.Revit.DB DWFImportOptions
     Various link options applicable to the DWF format.

#### Return Value

A collection of link instance element ids created by the markup link.

# Remarks

Link isn't supported for family documents. Please use import instead.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Not a valid file for DWF import (.dwf or.dwfx files are valid). -or- Some of the views are not importable. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | The given file does not exist. |
| Autodesk.Revit.Exceptions InvalidOperationException | Import is temporarily disabled. -or- This Document is not a project document. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

Document Class

Link Overload

Autodesk.Revit.DB Namespace

#### LoadAreaIsProjected Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Projected Load"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadAreaIsProjected { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadAreaIsProjected As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadAreaIsProjected { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TrussMemberInfo Class

---

|  |
| --- |
| Members   See Also |

Provides access to the information of a truss member in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class TrussMemberInfo ``` |

| Visual Basic |
| --- |
| ``` Public Class TrussMemberInfo ``` |

| Visual C++ |
| --- |
| ``` public ref class TrussMemberInfo ``` |

# Remarks

A struct TrussMemberInfo that contains an element's host truss, whether to lock to the truss, usage type, etc.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure TrussMemberInfo

# See Also

TrussMemberInfo Members

Autodesk.Revit.DB.Structure Namespace

#### AddPoint Method

---

|  |
| --- |
| IndexStreamPoint Class   See Also |

Inserts a  IndexPoint  into the stream and associated buffer.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void AddPoint( 	IndexPoint point ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddPoint ( _ 	point As IndexPoint _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddPoint( 	IndexPoint^ point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB.DirectContext3D IndexPoint
     The point to be inserted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also

IndexStreamPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### View Property

---

|  |
| --- |
| ViewPrintedEventArgs Class   See Also |

The view that was printed.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public View View { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property View As View 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property View^ View { 	View^ get (); } ``` |

# See Also

ViewPrintedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### BendDiameterNegative Property

---

|  |
| --- |
| BuiltInFailures FabricFailures Class   See Also |

Fabric Bend Diameter is negative.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BendDiameterNegative { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BendDiameterNegative As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BendDiameterNegative { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricFailures Class

Autodesk.Revit.DB Namespace

#### ServerGUID Property

---

|  |
| --- |
| PipeFittingAndAccessoryData Class   See Also |

The GUID of the pipe fitting or pipe accessory.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public Guid ServerGUID { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ServerGUID As Guid 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Guid ServerGUID { 	Guid get (); } ``` |

# See Also

PipeFittingAndAccessoryData Class

Autodesk.Revit.DB.Plumbing Namespace

#### PrintSetting Class

---

|  |
| --- |
| Members   See Also |

Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class PrintSetting : Element,  	IPrintSetting ``` |

| Visual Basic |
| --- |
| ``` Public Class PrintSetting _ 	Inherits Element _ 	Implements IPrintSetting ``` |

| Visual C++ |
| --- |
| ``` public ref class PrintSetting : public Element,  	IPrintSetting ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB PrintSetting

# See Also

PrintSetting Members

Autodesk.Revit.DB Namespace

#### GetPhaseMap Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

Returns a mapping between phases in the host document and phases in the linked document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2018.3

# Syntax

| C# |
| --- |
| ``` public IDictionary<ElementId, ElementId> GetPhaseMap() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPhaseMap As IDictionary(Of ElementId, ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: IDictionary<ElementId^, ElementId^>^ GetPhaseMap() ``` |

#### Return Value

A map from phases in the host document to phases in the linked document. The first value in each pair is the ElementId of a phase in the host document. The second value is the ElementId of the matching phase in the linked document.

# Remarks

This map is used to determine which phase in the linked document corresponds to each phase in the host document. This map is used to correctly calculate room geometry for room-bounding links. Multiple phases in the host document can correspond to the same phase in the linked document. Time order must be respected - if the host document has phases 1 and 2, and the linked document has phases A and B, it would not be proper to map 1 to B and 2 to A. If the user has not explicitly set the map values in the UI, the map will be as follows: Revit attempts to find a match for each host phase, moving in order from earliest to latest phase. First Revit will look for a phase in the linked document with the same name as the host phase. If there is no name match, the last phase in the link will be chosen as the match. Once Revit has matched a host phase to the last link phase, all other host phases will be matched to the last link phase, even if later host phases might have a name match.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The RvtLinkSymbol is not loaded. -or- This Revit link doesn't have a valid phase map. |

# See Also

RevitLinkType Class

Autodesk.Revit.DB Namespace

#### HighlightHandleConstraintPairInAllViews Method

---

|  |
| --- |
| RebarConstraintsManager Class   See Also |

Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void HighlightHandleConstraintPairInAllViews( 	Document aDoc, 	RebarConstrainedHandle handle, 	RebarConstraint constraint ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub HighlightHandleConstraintPairInAllViews ( _ 	aDoc As Document, _ 	handle As RebarConstrainedHandle, _ 	constraint As RebarConstraint _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void HighlightHandleConstraintPairInAllViews( 	Document^ aDoc,  	RebarConstrainedHandle^ handle,  	RebarConstraint^ constraint ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document

handle
:   Type:  Autodesk.Revit.DB.Structure RebarConstrainedHandle
     The RebarConstrainedHandle to be highlighted in all views.

constraint
:   Type:  Autodesk.Revit.DB.Structure RebarConstraint
     The RebarConstraint to be highlighted in all views.

# Remarks

This method is provided as a way to help end users visualize more easily the effect that selecting new RebarConstraints for the Rebar element's RebarConstrainedHandle will have on the Rebar. It is purely for graphical output, and does not assume any relationship between the RebarConstrainedHandle and the RebarConstraint. The caller is responsible for updating (or clearing) the highlighting in response to changes in the Rebar's constraints. Repeated calls to this method are not cumulative; highlighting from previous calls will be cleared before new highlighting is applied.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | constraint is no longer valid. -or- handle is no longer valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The RebarConstraintsManager does not manage a valid Rebar element. |

# See Also

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace

#### IsDone Method

---

|  |
| --- |
| ExportPatternTableIterator Class   See Also |

Identifies if the iteration has completed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool IsDone() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function IsDone As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool IsDone() ``` |

#### Return Value

True if the iteration has no more items. False if there are more items to be iterated.

# See Also

ExportPatternTableIterator Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| PanelTypeSet Class   See Also |

Retrieve a backward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual PanelTypeSetIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As PanelTypeSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual PanelTypeSetIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the set.

# See Also

PanelTypeSet Class

Autodesk.Revit.DB Namespace

#### GetAllCapsStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are in all caps.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public FormatStatus GetAllCapsStatus() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAllCapsStatus As FormatStatus ``` |

| Visual C++ |
| --- |
| ``` public: FormatStatus GetAllCapsStatus() ``` |

#### Return Value

The format status of all caps on characters  FormatStatus  .

# Remarks

This function only returns  All  or  None  if the entire text contains one character.

# See Also

FormattedText Class

GetAllCapsStatus Overload

Autodesk.Revit.DB Namespace

#### WSPerMSup3 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol WÂ·s/mÂ³, indicating unit Watts per cubic meter per second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WSPerMSup3 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WSPerMSup3 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WSPerMSup3 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### ShapeFailure Property

---

|  |
| --- |
| BuiltInFailures RebarShapeFailures Class   See Also |

The displayed Rebar Shape is created using a 'Rebar Bar for Preview'. This bar defines the bend radius displayed in the family. Using this preview bar the drawn shape cannot be completed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ShapeFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ShapeFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ShapeFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarShapeFailures Class

Autodesk.Revit.DB Namespace

#### SteelElementModifiersWillBeIgnoredWarn Property

---

|  |
| --- |
| BuiltInFailures SteelElementsFailures Class   See Also |

The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SteelElementModifiersWillBeIgnoredWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElementModifiersWillBeIgnoredWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SteelElementModifiersWillBeIgnoredWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SteelElementsFailures Class

Autodesk.Revit.DB Namespace

#### NewFormByThickenSingleSurface Method

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Create a new Form element by thickening a single-surface form, and add it into the Autodesk Revit family document.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Form NewFormByThickenSingleSurface( 	bool isSolid, 	Form singleSurfaceForm, 	XYZ thickenDir ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewFormByThickenSingleSurface ( _ 	isSolid As Boolean, _ 	singleSurfaceForm As Form, _ 	thickenDir As XYZ _ ) As Form ``` |

| Visual C++ |
| --- |
| ``` public: Form^ NewFormByThickenSingleSurface( 	bool isSolid,  	Form^ singleSurfaceForm,  	XYZ^ thickenDir ) ``` |

#### Parameters

isSolid
:   Type:  System Boolean
     Indicates if the Form is Solid or Void.

singleSurfaceForm
:   Type:  Autodesk.Revit.DB Form
     The single-surface form element. It can have one top/bottom face or one side face.

thickenDir
:   Type:  Autodesk.Revit.DB XYZ
     The offset of capped solid.

#### Return Value

This function will modify the input singleSurfaceForm and return the same element.

# See Also

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace

#### GetReferences Method

---

|  |
| --- |
| Selection Class   See Also |

Returns the references that are currently selected.

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public IList<Reference> GetReferences() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetReferences As IList(Of Reference) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Reference^>^ GetReferences() ``` |

#### Return Value

The collection containing the selected references.

# Remarks

The references can be an element or subelement in the host or a linked document.

# See Also

Selection Class

Autodesk.Revit.UI.Selection Namespace

#### LoadCaseNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Case Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadCaseNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadCaseNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadCaseNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SlopeAngle Property

---

|  |
| --- |
| FootPrintRoof Class   See Also |

Retrieve or set the SlopeAngle of the curve.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double this[ 	ModelCurve pCurve ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SlopeAngle ( _ 	pCurve As ModelCurve _ ) As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double SlopeAngle[ModelCurve^ pCurve] { 	double get (ModelCurve^ pCurve); 	void set (ModelCurve^ pCurve, double value); } ``` |

#### Parameters

pCurve
:   Type:  Autodesk.Revit.DB ModelCurve

# Remarks

The value is a "slope" measurement. For example, 0.5 is one unit of rise for each 2 units of run. This creates a slope of 26.57 degrees (the arctangent of 0.5).

# See Also

FootPrintRoof Class

Autodesk.Revit.DB Namespace

#### OfVector Method

---

|  |
| --- |
| Transform Class   See Also |

Applies the transform to the vector

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ OfVector( 	XYZ vec ) ``` |

| Visual Basic |
| --- |
| ``` Public Function OfVector ( _ 	vec As XYZ _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ OfVector( 	XYZ^ vec ) ``` |

#### Parameters

vec
:   Type:  Autodesk.Revit.DB XYZ
     The vector to be transformed

#### Return Value

The new vector after transform

# Remarks

Transformation of a vector is not affected by the translational part of the transformation.

# See Also

Transform Class

Autodesk.Revit.DB Namespace

#### StairsLandingtypeTreadriserType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Type": Tread/Riser Type

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsLandingtypeTreadriserType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsLandingtypeTreadriserType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsLandingtypeTreadriserType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetElement Method (Reference)

---

|  |
| --- |
| Document Class   See Also |

Gets the Element referenced by the input reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Element GetElement( 	Reference reference ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetElement ( _ 	reference As Reference _ ) As Element ``` |

| Visual C++ |
| --- |
| ``` public: Element^ GetElement( 	Reference^ reference ) ``` |

#### Parameters

reference
:   Type:  Autodesk.Revit.DB Reference
     The reference, whose referenced Element will be retrieved from the model.

#### Return Value

The element referenced by the input argument.

# Remarks

a null reference (  Nothing  in Visual Basic)  will be returned if the input reference doesn't reference to a valid Element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Document Class

GetElement Overload

Autodesk.Revit.DB Namespace

#### BuildingPadNoSurfaceError Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

A Pad can't extend beyond the edge of a Toposurface.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BuildingPadNoSurfaceError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BuildingPadNoSurfaceError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BuildingPadNoSurfaceError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### Location Property

---

|  |
| --- |
| IFCConnectedWallData Class   See Also |

The location for the join.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IFCConnectedWallDataLocation Location { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Location As IFCConnectedWallDataLocation 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property IFCConnectedWallDataLocation Location { 	IFCConnectedWallDataLocation get (); } ``` |

# See Also

IFCConnectedWallData Class

Autodesk.Revit.DB.IFC Namespace

#### BeginConnectorIndex Property

---

|  |
| --- |
| PipeFittingAndAccessoryPressureDropItem Class   See Also |

The index of the begin connector of the flow path

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int BeginConnectorIndex { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property BeginConnectorIndex As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int BeginConnectorIndex { 	int get (); } ``` |

# See Also

PipeFittingAndAccessoryPressureDropItem Class

Autodesk.Revit.DB.Plumbing Namespace

#### RbsFamilyContentAnnotationDisplay Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Use Annotation Scale"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsFamilyContentAnnotationDisplay { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsFamilyContentAnnotationDisplay As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsFamilyContentAnnotationDisplay { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StairsRunJustification Enumeration

---

|  |
| --- |
| See Also |

The position of the run relative to the Up-direction path used to create the run.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsRunJustification ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsRunJustification ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsRunJustification ``` |

# Members

| Member name | Description |
| --- | --- |
| Left | The creation path for the run is the left edge. |
| Center | The creation path for the run is the center. |
| Right | The creation path for the run is the right edge. |
| LeftExterior | The creation path for the run is the left stringer exterior edge. |
| RightExterior | The creation path for the run is the right stringer exterior edge. |

# See Also

Autodesk.Revit.DB.Architecture Namespace

#### SlabShapeEdit Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Slab Shape Edit"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SlabShapeEdit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SlabShapeEdit As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SlabShapeEdit { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### MeasureFrom Property

---

|  |
| --- |
| PointLocationOnCurve Class   See Also |

The location on the curve from which the measurement is taken.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public PointOnCurveMeasureFrom MeasureFrom { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MeasureFrom As PointOnCurveMeasureFrom 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property PointOnCurveMeasureFrom MeasureFrom { 	PointOnCurveMeasureFrom get (); 	void set (PointOnCurveMeasureFrom value); } ``` |

# Remarks

The measure-from is not checked until this class is assigned for a particular reference point on a particular curve. At that time, the measure-from must be valid for the curve.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PointLocationOnCurve Class

Autodesk.Revit.DB Namespace

#### AsCurve Method

---

|  |
| --- |
| Edge Class   See Also |

Returns a curve that corresponds to the edge's parametric orientation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Curve AsCurve() ``` |

| Visual Basic |
| --- |
| ``` Public Function AsCurve As Curve ``` |

| Visual C++ |
| --- |
| ``` public: Curve^ AsCurve() ``` |

#### Return Value

It can be an Arc, Line, or HermiteSpline.

# See Also

Edge Class

Autodesk.Revit.DB Namespace

#### PreviousCurveType Property

---

|  |
| --- |
| HorizontalCurveEndpoint Class   See Also |

The  HorizontalCurveType  of the curve which connects the endpoint to the previous displayed curve. If this endpoint's  Station  equals  DisplayedStartStation  , returns Unknown curve type.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public HorizontalCurveType PreviousCurveType { get; internal set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PreviousCurveType As HorizontalCurveType 	Get 	Friend Set ``` |

| Visual C++ |
| --- |
| ``` public: property HorizontalCurveType PreviousCurveType { 	HorizontalCurveType get (); 	internal: void set (HorizontalCurveType value); } ``` |

# See Also

HorizontalCurveEndpoint Class

Autodesk.Revit.DB.Infrastructure Namespace

#### CmCaret2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol cm^2, indicating unit Square centimeters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CmCaret2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CmCaret2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CmCaret2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### InSessionPrintSetting Class

---

|  |
| --- |
| Members   See Also |

Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class InSessionPrintSetting : IPrintSetting,  	IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class InSessionPrintSetting _ 	Implements IPrintSetting, IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class InSessionPrintSetting : IPrintSetting,  	IDisposable ``` |

# Remarks

The in-session PrintSetting can't be stored in document.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB InSessionPrintSetting

# See Also

InSessionPrintSetting Members

Autodesk.Revit.DB Namespace

#### LinkedResourceOpenedEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by  [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpened]  .

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public class LinkedResourceOpenedEventArgs : RevitAPIPostDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class LinkedResourceOpenedEventArgs _ 	Inherits RevitAPIPostDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class LinkedResourceOpenedEventArgs : public RevitAPIPostDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostDocEventArgs
  Autodesk.Revit.DB.Events LinkedResourceOpenedEventArgs

# See Also

LinkedResourceOpenedEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### BoundaryXRotationFixed Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"X Rotation - Fixed"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BoundaryXRotationFixed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BoundaryXRotationFixed As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BoundaryXRotationFixed { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| MullionTypeSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

MullionTypeSetIterator Class

Autodesk.Revit.DB Namespace

#### ChangeTypeId Method

---

|  |
| --- |
| Subelement Class   See Also |

Changes the type of the subelement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void ChangeTypeId( 	ElementId typeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ChangeTypeId ( _ 	typeId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ChangeTypeId( 	ElementId^ typeId ) ``` |

#### Parameters

typeId
:   Type:  Autodesk.Revit.DB ElementId
     Identifier of the type to assign to this subelement.

# Remarks

In rare cases, applying a change in type will result in a new element being created. The only active examples of this are when:

* Applying a normal wall type to a curtain panel.
* Converting such a wall back to a curtain panel.
* Applying a new type to a railing subelement.

In this situation this subelement object will be redirected to the new element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The type typeId is not valid for this subelement. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This Subelement cannot have type assigned. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | This Subelement is an internal element, such as a component of a loaded family or a group type. -or- The document containing this Subelement is in Group Edit Mode, Sketch Edit Mode, or Paste Mode, and the element is not a member of the group, sketch, or clipboard. -or- This Subelement is a member of a group or sketch, and the document is not currently editing the group or sketch. |

# See Also

Subelement Class

Autodesk.Revit.DB Namespace

#### RebarSystemDirectionNotSpecified Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Major direction not specified.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RebarSystemDirectionNotSpecified { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemDirectionNotSpecified As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RebarSystemDirectionNotSpecified { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### GetCoverType Method

---

|  |
| --- |
| RebarHostData Class   See Also |

Gets the CoverType associated with a face of the element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public RebarCoverType GetCoverType( 	Reference face ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCoverType ( _ 	face As Reference _ ) As RebarCoverType ``` |

| Visual C++ |
| --- |
| ``` public: RebarCoverType^ GetCoverType( 	Reference^ face ) ``` |

#### Parameters

face
:   Type:  Autodesk.Revit.DB Reference

#### Return Value

The cover associated with the face, if it is an exposed face. If the face is concealed, returns    a null reference (  Nothing  in Visual Basic)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarHostData Class

Autodesk.Revit.DB.Structure Namespace

#### IsValidObject Property

---

|  |
| --- |
| ModuleSettings Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ModuleSettings Class

Autodesk.Revit.DB.Macros Namespace

#### WrongFabricSheetStartOverhang Property

---

|  |
| --- |
| BuiltInFailures FabricFailures Class   See Also |

Wrong Start Overhang of the Fabric Sheet Type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WrongFabricSheetStartOverhang { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WrongFabricSheetStartOverhang As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WrongFabricSheetStartOverhang { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricFailures Class

Autodesk.Revit.DB Namespace

#### ConcreteBmMap Property

---

|  |
| --- |
| Concrete Class   See Also |

The property labeled "Image" from the "Concrete" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string ConcreteBmMap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConcreteBmMap As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ ConcreteBmMap { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

# See Also

Concrete Class

Autodesk.Revit.DB.Visual Namespace

#### GetDiagramSettings Method

---

|  |
| --- |
| AnalysisDisplayStyle Class   See Also |

Get diagram settings object from the style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayDiagramSettings GetDiagramSettings() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDiagramSettings As AnalysisDisplayDiagramSettings ``` |

| Visual C++ |
| --- |
| ``` public: AnalysisDisplayDiagramSettings^ GetDiagramSettings() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | diagram settings were not created with the object. |

# See Also

AnalysisDisplayStyle Class

Autodesk.Revit.DB.Analysis Namespace

#### DisplayUnitSystem Property

---

|  |
| --- |
| Document Class   See Also |

Provides access to display unit type with in the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public DisplayUnit DisplayUnitSystem { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DisplayUnitSystem As DisplayUnit 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property DisplayUnit DisplayUnitSystem { 	DisplayUnit get (); } ``` |

# Remarks

Return the display unit type, metric or imperial.

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### RbsElecWireGroundAdjustment Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Ground Conductors"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecWireGroundAdjustment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecWireGroundAdjustment As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecWireGroundAdjustment { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| Categories Class   See Also |

Inserts the specified category with the specified name into the map.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override bool Insert( 	string key, 	Category item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Function Insert ( _ 	key As String, _ 	item As Category _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	String^ key,  	Category^ item ) override ``` |

#### Parameters

key
:   Type:  System String
     The name to be used for inserting the category into the map.

item
:   Type:  Autodesk.Revit.DB Category
     The category to be inserted into the map.

#### Return Value

Whether or not the category was inserted into the map.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Always thrown; this list is read only. |

# See Also

Categories Class

Autodesk.Revit.DB Namespace

#### Fc Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol fc, indicating unit Footcandles.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Fc { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Fc As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Fc { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### TrussFamilyVertWebAngleParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Angle"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TrussFamilyVertWebAngleParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TrussFamilyVertWebAngleParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TrussFamilyVertWebAngleParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ProjectInformation Property

---

|  |
| --- |
| Document Class   See Also |

Return the Project Information of the current project.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ProjectInfo ProjectInformation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ProjectInformation As ProjectInfo 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ProjectInfo^ ProjectInformation { 	ProjectInfo^ get (); } ``` |

#### Return Value

Autodesk::Revit::DB::ProjectInfo

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### NoLevelsLeftReloading Property

---

|  |
| --- |
| BuiltInFailures LevelFailures Class   See Also |

As a result of Reloading Latest, there are no Levels left. Create a new Level, and then Reload Latest again.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoLevelsLeftReloading { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoLevelsLeftReloading As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoLevelsLeftReloading { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures LevelFailures Class

Autodesk.Revit.DB Namespace

#### GetOrCreateDefaultRebarShape Method

---

|  |
| --- |
| PathReinforcement Class   See Also |

Creates a new RebarShape object with a default name or returns existing one which fulfills Path Reinforcement bending data requirements.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static ElementId GetOrCreateDefaultRebarShape( 	Document document, 	ElementId rebarBarTypeId, 	ElementId startRebarHookTypeId, 	ElementId endRebarHookTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetOrCreateDefaultRebarShape ( _ 	document As Document, _ 	rebarBarTypeId As ElementId, _ 	startRebarHookTypeId As ElementId, _ 	endRebarHookTypeId As ElementId _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ GetOrCreateDefaultRebarShape( 	Document^ document,  	ElementId^ rebarBarTypeId,  	ElementId^ startRebarHookTypeId,  	ElementId^ endRebarHookTypeId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

rebarBarTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarBarType.

startRebarHookTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarHookType for the start of the bar. If this parameter is InvalidElementId, it means to create a rebar with no start hook.

endRebarHookTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarHookType for the end of the bar. If this parameter is InvalidElementId, it means to create a rebar with no end hook.

#### Return Value

Rebar Shape id.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | rebarBarTypeId should refer to an RebarBarType element. -or- startRebarHookTypeId should be invalid or refer to an RebarHookType element. -or- endRebarHookTypeId should be invalid or refer to an RebarHookType element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PathReinforcement Class

Autodesk.Revit.DB.Structure Namespace

#### PaPerM Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Pa/m, indicating unit Pascals per meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PaPerM { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PaPerM As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PaPerM { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### ViewSolarstudyMultidayFrameText Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Multi-day frame text"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewSolarstudyMultidayFrameText { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewSolarstudyMultidayFrameText As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewSolarstudyMultidayFrameText { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StairstypeCutmarkType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cut Mark Type": Cut Mark Type

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairstypeCutmarkType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairstypeCutmarkType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairstypeCutmarkType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CreateFaceGeometryInfo Method (Double, Boolean)

---

|  |
| --- |
| IFCGeometryInfo Class   See Also |

Creates a new container object which holds IfcFace handles processed from a Revit geometry object.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static IFCGeometryInfo CreateFaceGeometryInfo( 	double epsilon, 	bool isCoarse ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateFaceGeometryInfo ( _ 	epsilon As Double, _ 	isCoarse As Boolean _ ) As IFCGeometryInfo ``` |

| Visual C++ |
| --- |
| ``` public: static IFCGeometryInfo^ CreateFaceGeometryInfo( 	double epsilon,  	bool isCoarse ) ``` |

#### Parameters

epsilon
:   Type:  System Double
     The epsilon value used to process surfaces.

isCoarse
:   Type:  System Boolean
     Indicates whether we should use a coarse representation.

#### Return Value

The new geometry info container.

# See Also

IFCGeometryInfo Class

CreateFaceGeometryInfo Overload

Autodesk.Revit.DB.IFC Namespace

#### Item Property

---

|  |
| --- |
| FaceArray Class   See Also |

Gets or sets a face at a specified index within the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Face this[ 	int index ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property Item ( _ 	index As Integer _ ) As Face 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Face^ Item[int index] { 	Face^ get (int index); 	void set (int index, Face^ value); } ``` |

#### Parameters

index
:   Type:  System Int32
     The index of the face to be set or retrieved.

#### Return Value

Returns the face at the specified index.

# See Also

FaceArray Class

Autodesk.Revit.DB Namespace

#### CanAddBarGeometry Method

---

|  |
| --- |
| RebarTrimExtendData Class   See Also |

Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool CanAddBarGeometry() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanAddBarGeometry As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanAddBarGeometry() ``` |

# See Also

RebarTrimExtendData Class

Autodesk.Revit.DB.Structure Namespace

#### CurtainPanelHorizontalSpacing Property

---

|  |
| --- |
| Family Class   See Also |

For Curtain Panel families, the horizontal spacing of the driving mesh.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double CurtainPanelHorizontalSpacing { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CurtainPanelHorizontalSpacing As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double CurtainPanelHorizontalSpacing { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if this family is not the owner family of a curtain panel family document. |

# See Also

Family Class

Autodesk.Revit.DB Namespace

#### Lookup Method

---

|  |
| --- |
| SharedParameterElement Class   See Also |

Finds the shared parameter element that corresponds to the given Guid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static SharedParameterElement Lookup( 	Document document, 	Guid guidValue ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Lookup ( _ 	document As Document, _ 	guidValue As Guid _ ) As SharedParameterElement ``` |

| Visual C++ |
| --- |
| ``` public: static SharedParameterElement^ Lookup( 	Document^ document,  	Guid guidValue ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

guidValue
:   Type:  System Guid
     Shared parameter Guid.

#### Return Value

The retrieved shared parameter instance, or    a null reference (  Nothing  in Visual Basic)  if the matching element is not found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SharedParameterElement Class

Autodesk.Revit.DB Namespace

#### GetFaceRegions Method

---

|  |
| --- |
| CurveByPointsUtils Class   See Also |

Gets the FaceRegions in the existing face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static IList<Reference> GetFaceRegions( 	Document cda, 	Reference referenceOfFace ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetFaceRegions ( _ 	cda As Document, _ 	referenceOfFace As Reference _ ) As IList(Of Reference) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<Reference^>^ GetFaceRegions( 	Document^ cda,  	Reference^ referenceOfFace ) ``` |

#### Parameters

cda
:   Type:  Autodesk.Revit.DB Document
     The Document.

referenceOfFace
:   Type:  Autodesk.Revit.DB Reference
     The Reference of the existing face.

#### Return Value

The FaceRegions in the existing face, or an empty collection if no FaceRegions are found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The Reference is not a Face Reference. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace

#### IsValidSketchPlane Method

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

Identifies if provided sketch plane is valid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool IsValidSketchPlane( 	Document document, 	ElementId sketchPlaneId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidSketchPlane ( _ 	document As Document, _ 	sketchPlaneId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidSketchPlane( 	Document^ document,  	ElementId^ sketchPlaneId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

sketchPlaneId
:   Type:  Autodesk.Revit.DB ElementId
     SketchPlane ids to be tested for validity for PartMaker.

#### Return Value

True if SketchPlane valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartMakerMethodToDivideVolumes Class

Autodesk.Revit.DB Namespace

#### ImageResolution Property

---

|  |
| --- |
| ImageExportOptions Class   See Also |

The image resolution in dots per inch.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ImageResolution ImageResolution { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ImageResolution As ImageResolution 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ImageResolution ImageResolution { 	ImageResolution get (); 	void set (ImageResolution value); } ``` |

# Remarks

The default is DPI\_72.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ImageExportOptions Class

Autodesk.Revit.DB Namespace

#### HasValidAlphanumericRevisionSettings Method

---

|  |
| --- |
| RevisionNumberingSequence Class   See Also |

Checks whether the revision numbering sequence owns a valid alphanumeric revision settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool HasValidAlphanumericRevisionSettings() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasValidAlphanumericRevisionSettings As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasValidAlphanumericRevisionSettings() ``` |

#### Return Value

True if the revision numbering sequence owns a valid alphanumeric revision settings.

# See Also

RevisionNumberingSequence Class

Autodesk.Revit.DB Namespace

#### IsCustomHandle Method

---

|  |
| --- |
| RebarConstrainedHandle Class   See Also |

Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool IsCustomHandle() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsCustomHandle As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsCustomHandle() ``` |

# See Also

RebarConstrainedHandle Class

Autodesk.Revit.DB.Structure Namespace

#### UpDirection Property

---

|  |
| --- |
| HomeCamera Class   See Also |

The up direction vector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ UpDirection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property UpDirection As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ UpDirection { 	XYZ^ get (); } ``` |

# See Also

HomeCamera Class

Autodesk.Revit.DB Namespace

#### IsCurveLoopValid Method

---

|  |
| --- |
| AnalyticalSurfaceBase Class   See Also |

Checks if curve loop is valid for Analytical Panel.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static bool IsCurveLoopValid( 	CurveLoop profile ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsCurveLoopValid ( _ 	profile As CurveLoop _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsCurveLoopValid( 	CurveLoop^ profile ) ``` |

#### Parameters

profile
:   Type:  Autodesk.Revit.DB CurveLoop
     The curve loop to be checked.

#### Return Value

Returns true if curve loop is ok, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AnalyticalSurfaceBase Class

Autodesk.Revit.DB.Structure Namespace

#### DimLeaderDisplayCondition Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Show Leader When Text Moves"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimLeaderDisplayCondition { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimLeaderDisplayCondition As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimLeaderDisplayCondition { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SelectableInViewFilter Class

---

|  |
| --- |
| Members   See Also |

A filter that passes elements that are selectable in the given view.

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class SelectableInViewFilter : ElementSlowFilter ``` |

| Visual Basic |
| --- |
| ``` Public Class SelectableInViewFilter _ 	Inherits ElementSlowFilter ``` |

| Visual C++ |
| --- |
| ``` public ref class SelectableInViewFilter : public ElementSlowFilter ``` |

# Remarks

This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded. This filter is designed to operate on a list of elements visible in the given view. This can be obtained from a FilteredElementCollector constructed with the view id. This filter may not correctly restrict elements which are not a part of the visible elements of the view.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ElementFilter
  Autodesk.Revit.DB ElementSlowFilter
  Autodesk.Revit.UI.Selection SelectableInViewFilter

# See Also

SelectableInViewFilter Members

Autodesk.Revit.UI.Selection Namespace

#### OpenAndActivateDocument Method (ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback)

---

|  |
| --- |
| UIApplication Class   See Also |

Opens and activates a Revit document, include both local document or cloud document.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public UIDocument OpenAndActivateDocument( 	ModelPath modelPath, 	OpenOptions openOptions, 	bool detachAndPrompt, 	IOpenFromCloudCallback openFromCloudCallback ) ``` |

| Visual Basic |
| --- |
| ``` Public Function OpenAndActivateDocument ( _ 	modelPath As ModelPath, _ 	openOptions As OpenOptions, _ 	detachAndPrompt As Boolean, _ 	openFromCloudCallback As IOpenFromCloudCallback _ ) As UIDocument ``` |

| Visual C++ |
| --- |
| ``` public: UIDocument^ OpenAndActivateDocument( 	ModelPath^ modelPath,  	OpenOptions^ openOptions,  	bool detachAndPrompt,  	IOpenFromCloudCallback^ openFromCloudCallback ) ``` |

#### Parameters

modelPath
:   Type:  Autodesk.Revit.DB ModelPath
     A path to a Revit file to be opened. The file can be either a Revit project, template, or family document.

openOptions
:   Type:  Autodesk.Revit.DB OpenOptions
     Options for opening the file.

detachAndPrompt
:   Type:  System Boolean
     True means if openOptions specifies DoNotDetach, then for workshared models detach from central and query the user whether to preserve or discard worksets. make no sense when opening a cloud document.

openFromCloudCallback
:   Type:  Autodesk.Revit.DB IOpenFromCloudCallback
     Callback function that allow caller to handle cases when conflicts happen during opening a cloud document. Make no sense when opening a non-cloud document.

#### Return Value

The opened document.

# Remarks

This method, if successful, changes the active document. It is not allowed to have an open transaction in the active document when calling this method. Consequently, this method can only be used in manual transaction mode, not in automatic mode. Additionally, this method may not be called from inside an event handler.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | If DetachFromCentralOption is not DoNotDetach when opening a cloud document.  * If the active document is currently modifiable. * If an API event handler is currently being executed. |
| Autodesk.Revit.Exceptions ArgumentNullException | If    a null reference (  Nothing  in Visual Basic)  is passed as 'modelPath'. -or- If    a null reference (  Nothing  in Visual Basic)  is passed as 'openOptions'. -or- A non-optional argument was null |
| Autodesk.Revit.Exceptions CannotOpenBothCentralAndLocalException | Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session. |
| Autodesk.Revit.Exceptions CentralModelAccessDeniedException | Thrown when file is not found at the give path. |
| Autodesk.Revit.Exceptions CentralModelException | * Revit encountered serious errors while trying to open the central model. * An internal error happened on the central model, please contact the server administrator. |
| Autodesk.Revit.Exceptions CorruptModelException | There are too many corrupt elements to open this model. |
| Autodesk.Revit.Exceptions FileAccessException | * When file cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1. * when file has an invalid extension. Try changing the file's extension and opening it again. |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | The file specified by 'modelPath' cannot be found or the given 'modelPath' is not a Revit file (a project, template, or family document). |
| Autodesk.Revit.Exceptions InsufficientResourcesException | This computer does not have enough memory, disk space, or other necessary resource to open the model. |
| Autodesk.Revit.Exceptions InvalidOperationException | The cloud model is not saved in current release of Revit. -or- The model is not allowed to access. -or-  * The document can not be opened. * Open is temporarily disabled. * Revit cannot save the transmitted model as a new central because it is already opened. |
| Autodesk.Revit.Exceptions OperationCanceledException | Opening was canceled by the user or by an API event callback. |
| Autodesk.Revit.Exceptions RevitServerCommunicationException | If there is any server internal error. |
| Autodesk.Revit.Exceptions RevitServerUnauthenticatedUserException | User is not signed in with Autodesk id when trying to open a cloud model. |
| Autodesk.Revit.Exceptions RevitServerUnauthorizedException | User is not authorized to access the cloud model. |
| Autodesk.Revit.Exceptions WrongUserException | The local file is not owned by the current user, who therefore is not allowed to modify it. |

# See Also

UIApplication Class

OpenAndActivateDocument Overload

Autodesk.Revit.UI Namespace

#### GetAllUsersWithGraphicOverrides Method

---

|  |
| --- |
| WorksharingDisplaySettings Class   See Also |

Returns all usernames that have graphic overrides. This list consists of all users included in the user table + all users who have explicitly been assigned overrides.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ICollection<string> GetAllUsersWithGraphicOverrides() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAllUsersWithGraphicOverrides As ICollection(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<String^>^ GetAllUsersWithGraphicOverrides() ``` |

#### Return Value

All usernames that have been assigned graphic overrides.

# See Also

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| RenderingQualitySettings Class   See Also |

Releases all resources used by the  RenderingQualitySettings

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace

#### CreateMaterialTakeoff Method (Document, ElementId, ElementId, Boolean)

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

Creates a new material takeoff multicategory schedule assembly view for the assembly instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static ViewSchedule CreateMaterialTakeoff( 	Document document, 	ElementId assemblyInstanceId, 	ElementId viewTemplateId, 	bool isAssigned ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateMaterialTakeoff ( _ 	document As Document, _ 	assemblyInstanceId As ElementId, _ 	viewTemplateId As ElementId, _ 	isAssigned As Boolean _ ) As ViewSchedule ``` |

| Visual C++ |
| --- |
| ``` public: static ViewSchedule^ CreateMaterialTakeoff( 	Document^ document,  	ElementId^ assemblyInstanceId,  	ElementId^ viewTemplateId,  	bool isAssigned ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to which the view will be added.

assemblyInstanceId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the assembly instance that owns the new view.

viewTemplateId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the view template that is used to create the view; if invalidElementId, the view will be created with the default settings.

isAssigned
:   Type:  System Boolean
     If true, the template will be assigned, if false, the template will be applied.

#### Return Value

A new material takeoff multicategory schedule assembly view.

# Remarks

The material takeoff schedule will be preloaded with fields "Material: Name" and "Material: Volume". The document must be regenerated before using the schedule.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | assemblyInstanceId is not an AssemblyInstance. -or- viewTemplateId is not a correct view template for the schedule view. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

AssemblyViewUtils Class

CreateMaterialTakeoff Overload

Autodesk.Revit.DB Namespace

#### Name Property

---

|  |
| --- |
| ViewSheetSet Class   See Also |

The view sheet set name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override string Name { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Property Name As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property String^ Name { 	String^ get () override; 	void set (String^ value) override; } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when trying to set the name. Instead, set the name with the  Rename(String)  method. |

# See Also

ViewSheetSet Class

Autodesk.Revit.DB Namespace

#### Decimeters Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Decimeters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Decimeters { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Decimeters As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Decimeters { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### GridlinesWerePushed Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Panels and mullions created by a curtain grid were created with slight inaccuracies.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId GridlinesWerePushed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GridlinesWerePushed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ GridlinesWerePushed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### WinderPathResult Enumeration

---

|  |
| --- |
| See Also |

Flag indicates whether curves are valid to use as base lines for winder path.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum WinderPathResult ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WinderPathResult ``` |

| Visual C++ |
| --- |
| ``` public enum class WinderPathResult ``` |

# Members

| Member name | Description |
| --- | --- |
| Success | Indicates curves are valid to use as path base lines for winder run. This is only one flag indicates curves are fine to use as winder path. |
| NumberOutOfRange | The curves number is not 2 or 3. |
| Unbound | Curve is not bound. |
| Noncontinuous | The curves are not continuous in one loop. |
| NotOpenLoop | The curves are not in one open loop. |
| TooShort | Curve length is too short. |
| ColinearOrOverlap | Two curves are collinear or overlap. |
| SelfIntersect | The first curve intersect with third curve. |
| InvalidCurveType | Curve is not line. |
| NotSupported | This path(for zigzag winder) is not supported yet |

# See Also

Autodesk.Revit.DB.Architecture Namespace

#### ArrayAnchorMember Enumeration

---

|  |
| --- |
| See Also |

Represents the possible choices for how the translation or rotation is used to place each member of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum ArrayAnchorMember ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ArrayAnchorMember ``` |

| Visual C++ |
| --- |
| ``` public enum class ArrayAnchorMember ``` |

# Members

| Member name | Description |
| --- | --- |
| Second | The translation or rotation value specifies the location of the second member of the array. |
| Last | The translation or rotation value specifies the location of the last member of the array. |

# See Also

Autodesk.Revit.DB Namespace

#### OnShutdown Method

---

|  |
| --- |
| IExternalDBApplication Interface   See Also |

Implement this method to execute some tasks when Autodesk Revit shuts down.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` ExternalDBApplicationResult OnShutdown( 	ControlledApplication application ) ``` |

| Visual Basic |
| --- |
| ``` Function OnShutdown ( _ 	application As ControlledApplication _ ) As ExternalDBApplicationResult ``` |

| Visual C++ |
| --- |
| ``` ExternalDBApplicationResult OnShutdown( 	ControlledApplication^ application ) ``` |

#### Parameters

application
:   Type:  Autodesk.Revit.ApplicationServices ControlledApplication
     Handle to the Revit Application object.

#### Return Value

Indicates if the external db application completes its work successfully.

# See Also

IExternalDBApplication Interface

Autodesk.Revit.DB Namespace

#### SetMarkersAndTextSettings Method

---

|  |
| --- |
| AnalysisDisplayStyle Class   See Also |

Set markers and text settings object for the style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void SetMarkersAndTextSettings( 	AnalysisDisplayMarkersAndTextSettings markersAndTextSettings ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetMarkersAndTextSettings ( _ 	markersAndTextSettings As AnalysisDisplayMarkersAndTextSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetMarkersAndTextSettings( 	AnalysisDisplayMarkersAndTextSettings^ markersAndTextSettings ) ``` |

#### Parameters

markersAndTextSettings
:   Type:  Autodesk.Revit.DB.Analysis AnalysisDisplayMarkersAndTextSettings

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | markers and text settings were not created with the object. |

# See Also

AnalysisDisplayStyle Class

Autodesk.Revit.DB.Analysis Namespace

#### KgPerMin Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kg/min, indicating unit Kilograms per minute.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KgPerMin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KgPerMin As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KgPerMin { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IsTransparent Property

---

|  |
| --- |
| TextNode Class   See Also |

Indicates whether the text background is transparent or opaque.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool IsTransparent { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsTransparent As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsTransparent { 	bool get (); } ``` |

# See Also

TextNode Class

Autodesk.Revit.DB Namespace

#### GetResultSchema Method

---

|  |
| --- |
| SpatialFieldManager Class   See Also |

Returns result schema by index

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public AnalysisResultSchema GetResultSchema( 	int idx ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetResultSchema ( _ 	idx As Integer _ ) As AnalysisResultSchema ``` |

| Visual C++ |
| --- |
| ``` public: AnalysisResultSchema^ GetResultSchema( 	int idx ) ``` |

#### Parameters

idx
:   Type:  System Int32
     Index of registered result schema

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | idx refers to non-existent result schema |

# See Also

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace

#### UnifiedbitmapRGBAmount Property

---

|  |
| --- |
| UnifiedBitmap Class   See Also |

The property labeled "Brightness" from the "UnifiedBitmap" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static string UnifiedbitmapRGBAmount { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnifiedbitmapRGBAmount As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ UnifiedbitmapRGBAmount { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 1".

# See Also

UnifiedBitmap Class

Autodesk.Revit.DB.Visual Namespace

#### SketchNotEmpty Property

---

|  |
| --- |
| BuiltInFailures ProfileFailures Class   See Also |

Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SketchNotEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SketchNotEmpty As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SketchNotEmpty { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ProfileFailures Class

Autodesk.Revit.DB Namespace

#### StructuralSectionGeneralU Class

---

|  |
| --- |
| Members   See Also |

Defines parameters for general Channel shape.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public class StructuralSectionGeneralU : StructuralSectionHotRolled ``` |

| Visual Basic |
| --- |
| ``` Public Class StructuralSectionGeneralU _ 	Inherits StructuralSectionHotRolled ``` |

| Visual C++ |
| --- |
| ``` public ref class StructuralSectionGeneralU : public StructuralSectionHotRolled ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSection
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionRectangular
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionHotRolled
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionGeneralU
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionCParallelFlange
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionCSlopedFlange

# See Also

StructuralSectionGeneralU Members

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### GetOverrideColor Method

---

|  |
| --- |
| DrawContext Class   See Also |

Returns override color that will be applied to geometry during rendering.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static bool GetOverrideColor( 	out Color color ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetOverrideColor ( _ 	<OutAttribute> ByRef color As Color _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool GetOverrideColor( 	[OutAttribute] Color^% color ) ``` |

#### Parameters

color
:   Type:  Autodesk.Revit.DB Color   %

# See Also

DrawContext Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### GetBasicIEnumerator Method

---

|  |
| --- |
| ExportLayerTable Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` internal virtual IEnumerator GetBasicIEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Friend Overridable Function GetBasicIEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` internal: virtual IEnumerator^ GetBasicIEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable GetEnumerator

# See Also

ExportLayerTable Class

Autodesk.Revit.DB Namespace

#### DisplacedElementDisplacementX Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"X Displacement"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DisplacedElementDisplacementX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DisplacedElementDisplacementX As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DisplacedElementDisplacementX { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetCategories Method

---

|  |
| --- |
| FilterCategoryRule Class   See Also |

Sets the rule's categories.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool SetCategories( 	ICollection<ElementId> categories ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetCategories ( _ 	categories As ICollection(Of ElementId) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool SetCategories( 	ICollection<ElementId^>^ categories ) ``` |

#### Parameters

categories
:   Type:  System.Collections.Generic ICollection   ElementId
     The categories.

#### Return Value

True if the set of categories was changed, false if no change was necessary.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | One of the given categories is not filterable |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilterCategoryRule Class

Autodesk.Revit.DB Namespace

#### WithoutBoundaryEdges Property

---

|  |
| --- |
| FBXExportOptions Class   See Also |

True to export without boundary edges, false otherwise.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool WithoutBoundaryEdges { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property WithoutBoundaryEdges As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool WithoutBoundaryEdges { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

The default value is false.

# See Also

FBXExportOptions Class

Autodesk.Revit.DB Namespace

#### GetLastCoreLayerIndex Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

Gets the index of the last core layer.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int GetLastCoreLayerIndex() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLastCoreLayerIndex As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetLastCoreLayerIndex() ``` |

#### Return Value

The index of the last core layer.

# Remarks

This is the index on the interior side. You can change the shell/core layer boundary using  SetNumberOfShellLayers(ShellLayerType, Int32)  .

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### AddinFolder Property

---

|  |
| --- |
| ApplicationEntryPoint Class   See Also |

The full path to the Revit Macros module.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string AddinFolder { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property AddinFolder As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property String^ AddinFolder { 	String^ get () sealed; } ``` |

#### Implements

 IEntryPoint AddinFolder

# Remarks

This path should be used instead of the .NET GetExecutingAssembly() result, because the Macros module is loaded in such a way to make that result unreliable.

# See Also

ApplicationEntryPoint Class

Autodesk.Revit.DB.Macros Namespace

#### IsPipingEnabled Property

---

|  |
| --- |
| Application Class   See Also |

Checks whether or not the piping discipline is enabled, and enable or disable it.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsPipingEnabled { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsPipingEnabled As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsPipingEnabled { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### CannotJoinElementsStructural Property

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   See Also |

Can't keep elements joined.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotJoinElementsStructural { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotJoinElementsStructural As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotJoinElementsStructural { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace

#### LengthParameterError Property

---

|  |
| --- |
| BuiltInFailures RebarCouplerFailures Class   See Also |

This is used to post error. The "Total Length" parameter must be set to a strictly positive value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LengthParameterError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LengthParameterError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LengthParameterError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarCouplerFailures Class

Autodesk.Revit.DB Namespace

#### CreateMultipleConnections Method

---

|  |
| --- |
| MEPAnalyticalConnection Class   See Also |

Creates new analytical connections between the equipment connector and the nearest point on the curves.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static ISet<ElementId> CreateMultipleConnections( 	Document doc, 	ElementId typeId, 	IList<Connector> equipmentOpenConnectors, 	IList<ElementId> curveIdsToConnect ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateMultipleConnections ( _ 	doc As Document, _ 	typeId As ElementId, _ 	equipmentOpenConnectors As IList(Of Connector), _ 	curveIdsToConnect As IList(Of ElementId) _ ) As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ISet<ElementId^>^ CreateMultipleConnections( 	Document^ doc,  	ElementId^ typeId,  	IList<Connector^>^ equipmentOpenConnectors,  	IList<ElementId^>^ curveIdsToConnect ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document where the new elements are created.

typeId
:   Type:  Autodesk.Revit.DB ElementId
     The type of new analytical connections.

equipmentOpenConnectors
:   Type:  System.Collections.Generic IList   Connector
     The open equipment connectors to be analytically connected.

curveIdsToConnect
:   Type:  System.Collections.Generic IList   ElementId
     The curves which the equipment is connected to.

#### Return Value

The new analytical connection elements.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Invalid connection type. -or- Not all connectors support the analytical connection. -or- No connector included. -or- Not all elements are valid curve ids. -or- No curve included. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MEPAnalyticalConnection Class

Autodesk.Revit.DB Namespace

#### EdgeObject Property

---

|  |
| --- |
| IntersectionResult Class   See Also |

Edge of the face close to the point of intersection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Edge EdgeObject { get; internal set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property EdgeObject As Edge 	Get 	Friend Set ``` |

| Visual C++ |
| --- |
| ``` public: property Edge^ EdgeObject { 	Edge^ get (); 	internal: void set (Edge^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

# See Also

IntersectionResult Class

Autodesk.Revit.DB Namespace

#### PointCloudColorSettings Constructor (PointCloudColorSettings)

---

|  |
| --- |
| PointCloudColorSettings Class   See Also |

Constructs a copy of source object.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public PointCloudColorSettings( 	PointCloudColorSettings other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	other As PointCloudColorSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: PointCloudColorSettings( 	PointCloudColorSettings^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.PointClouds PointCloudColorSettings
     Source object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PointCloudColorSettings Class

PointCloudColorSettings Overload

Autodesk.Revit.DB.PointClouds Namespace

#### ShapeSet Property

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Whether or not the view crop has a non-rectangular shape set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool ShapeSet { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ShapeSet As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShapeSet { 	bool get (); } ``` |

# Remarks

This property reflects the actual shape of the crop region. Thus, if this property is true the view Split property is false.

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### FabricationDimensionUnitType Enumeration

---

|  |
| --- |
| See Also |

Fabrication dimension unit type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum FabricationDimensionUnitType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FabricationDimensionUnitType ``` |

| Visual C++ |
| --- |
| ``` public enum class FabricationDimensionUnitType ``` |

# Members

| Member name | Description |
| --- | --- |
| NoUnits | NoUnits. |
| Linear | Linear. |
| Angular | Angular. |

# See Also

Autodesk.Revit.DB Namespace

#### UISaveAsOptions Constructor

---

|  |
| --- |
| UISaveAsOptions Class   See Also |

Default constructor.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public UISaveAsOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: UISaveAsOptions() ``` |

# See Also

UISaveAsOptions Class

Autodesk.Revit.UI Namespace

#### ElemFamilyAndTypeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Family and Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ElemFamilyAndTypeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElemFamilyAndTypeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ElemFamilyAndTypeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AssemblyInstance Class

---

|  |
| --- |
| Members   Example   See Also |

Combines multiple elements for tagging, filtering, scheduling and creating isolated assembly views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class AssemblyInstance : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class AssemblyInstance _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class AssemblyInstance : public Element ``` |

# Examples

 Copy  C#

```
// Identify the difference, if any, between two assembly instances
void FindAssemblyDifferences(AssemblyInstance instance1, AssemblyInstance instance2)
{
    Autodesk.Revit.DB.Document doc = instance1.Document;
    AssemblyDifference difference = AssemblyInstance.CompareAssemblyInstances(instance1, instance2);

    AssemblyDifferenceNone diffNone = difference as AssemblyDifferenceNone;
    if (diffNone != null)
    {
        TaskDialog.Show("Revit", "Assemblies are identical");
        return;
    }

    AssemblyDifferenceConfiguration diffConfig = difference as AssemblyDifferenceConfiguration;
    if (diffConfig != null)
    {
        TaskDialog.Show("Revit", "Elements are not arranged in space relative to each other in the same way");
        return;
    }

    AssemblyDifferenceMemberCount diffMemberCount = difference as AssemblyDifferenceMemberCount;
    if (diffMemberCount != null)
    {
        TaskDialog.Show("Revit", "Elements counts differ: " + diffMemberCount.Count1 + " & " + diffMemberCount.Count2);
        return;
    }

    AssemblyDifferenceNamingCategory diffNameCat = difference as AssemblyDifferenceNamingCategory;
    if (diffNameCat != null)
    {
        TaskDialog.Show("Revit", "Naming categories differ: " +
            Category.GetCategory(doc, diffNameCat.NamingCategoryId1).Name + " & " +
            Category.GetCategory(doc, diffNameCat.NamingCategoryId2).Name);
        return;
    }

    AssemblyDifferenceMemberDifference memberDifference = difference as AssemblyDifferenceMemberDifference;
    if (memberDifference != null)
    {
        AssemblyMemberDifference assemblyMemberDifference = memberDifference.MemberDifference as AssemblyMemberDifference;

        AssemblyMemberDifferentCategory differentCategory = assemblyMemberDifference as AssemblyMemberDifferentCategory;
        if (differentCategory != null)
        {
            TaskDialog.Show("Revit", "Element categories differ: " +
                Category.GetCategory(doc, diffNameCat.NamingCategoryId1).Name + " & " +
                Category.GetCategory(doc, diffNameCat.NamingCategoryId2).Name);
            return;
        }
        AssemblyMemberDifferentGeometry differentGeometry = assemblyMemberDifference as AssemblyMemberDifferentGeometry;
        if (differentGeometry != null)
        {
            TaskDialog.Show("Revit", "Member geometry differs");
            return;
        }
        AssemblyMemberDifferentParameters differentParameters = assemblyMemberDifference as AssemblyMemberDifferentParameters;
        if (differentParameters != null)
        {
            TaskDialog.Show("Revit", "Member parameters differs");
            return;
        }
        AssemblyMemberDifferentType differentType = assemblyMemberDifference as AssemblyMemberDifferentType;
        if (differentType != null)
        {
            TaskDialog.Show("Revit", "Element types differ: " + doc.GetElement(differentType.TypeId1).Name + " & " + doc.GetElement(differentType.TypeId2).Name);
            return;
        }
    }
    return;
}
```

 Copy  VB.NET

```
' Identify the difference, if any, between two assembly instances
Private Sub FindAssemblyDifferences(instance1 As AssemblyInstance, instance2 As AssemblyInstance)
    Dim doc As Autodesk.Revit.DB.Document = instance1.Document
    Dim difference As AssemblyDifference = AssemblyInstance.CompareAssemblyInstances(instance1, instance2)

    Dim diffNone As AssemblyDifferenceNone = TryCast(difference, AssemblyDifferenceNone)
    If diffNone IsNot Nothing Then
        TaskDialog.Show("Revit", "Assemblies are identical")
        Return
    End If

    Dim diffConfig As AssemblyDifferenceConfiguration = TryCast(difference, AssemblyDifferenceConfiguration)
    If diffConfig IsNot Nothing Then
        TaskDialog.Show("Revit", "Elements are not arranged in space relative to each other in the same way")
        Return
    End If

    Dim diffMemberCount As AssemblyDifferenceMemberCount = TryCast(difference, AssemblyDifferenceMemberCount)
    If diffMemberCount IsNot Nothing Then
        TaskDialog.Show("Revit", "Elements counts differ: " + diffMemberCount.Count1 + " & " + diffMemberCount.Count2)
        Return
    End If

    Dim diffNameCat As AssemblyDifferenceNamingCategory = TryCast(difference, AssemblyDifferenceNamingCategory)
    If diffNameCat IsNot Nothing Then
        Dim catInt1 As Integer = diffNameCat.NamingCategoryId1.IntegerValue
        Dim catInt2 As Integer = diffNameCat.NamingCategoryId2.IntegerValue
        TaskDialog.Show("Revit", "Naming categories differ: " + doc.Settings.Categories.Item(DirectCast(catInt1, BuiltInCategory)).Name + " & " + doc.Settings.Categories.Item(DirectCast(catInt2, BuiltInCategory)).Name)
        Return
    End If

    Dim memberDifference As AssemblyDifferenceMemberDifference = TryCast(difference, AssemblyDifferenceMemberDifference)
    If memberDifference IsNot Nothing Then
        Dim assemblyMemberDifference As AssemblyMemberDifference = TryCast(memberDifference.MemberDifference, AssemblyMemberDifference)

        Dim differentCategory As AssemblyMemberDifferentCategory = TryCast(assemblyMemberDifference, AssemblyMemberDifferentCategory)
        If differentCategory IsNot Nothing Then
            Dim int1 As Integer = differentCategory.CategoryId1.IntegerValue
            Dim int2 As Integer = differentCategory.CategoryId2.IntegerValue
            TaskDialog.Show("Revit", "Element categories differ: " + doc.Settings.Categories.Item(DirectCast(int1, BuiltInCategory)).Name + " & " + doc.Settings.Categories.Item(DirectCast(int2, BuiltInCategory)).Name)
            Return
        End If
        Dim differentGeometry As AssemblyMemberDifferentGeometry = TryCast(assemblyMemberDifference, AssemblyMemberDifferentGeometry)
        If differentGeometry IsNot Nothing Then
            TaskDialog.Show("Revit", "Member geometry differs")
            Return
        End If
        Dim differentParameters As AssemblyMemberDifferentParameters = TryCast(assemblyMemberDifference, AssemblyMemberDifferentParameters)
        If differentParameters IsNot Nothing Then
            TaskDialog.Show("Revit", "Member parameters differs")
            Return
        End If
        Dim differentType As AssemblyMemberDifferentType = TryCast(assemblyMemberDifference, AssemblyMemberDifferentType)
        If differentType IsNot Nothing Then
            TaskDialog.Show("Revit", "Element types differ: " + doc.GetElement(differentType.TypeId1).Name + " & " + doc.GetElement(differentType.TypeId2).Name)
            Return
        End If
    End If
    Return
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB AssemblyInstance

# See Also

AssemblyInstance Members

Autodesk.Revit.DB Namespace

#### GetAnnotationCropShape Method

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Gets the annotation crop box assigned to the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public CurveLoop GetAnnotationCropShape() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAnnotationCropShape As CurveLoop ``` |

| Visual C++ |
| --- |
| ``` public: CurveLoop^ GetAnnotationCropShape() ``` |

#### Return Value

The annotation crop boundary.

# Remarks

Currently, this method returns only the rectangular annotation crop box.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | View is not allowed to have an annotation crop. |

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### ElevationDetach Property

---

|  |
| --- |
| BuiltInFailures ElevationFailures Class   See Also |

An Elevation arrow can't keep its Crop Region extents attached.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ElevationDetach { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElevationDetach As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ElevationDetach { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElevationFailures Class

Autodesk.Revit.DB Namespace

#### GetSegmentEndPoints Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

Gets the end points of a segment.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void GetSegmentEndPoints( 	int segmentId, 	int regionId, 	out UV end1, 	out UV end2 ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub GetSegmentEndPoints ( _ 	segmentId As Integer, _ 	regionId As Integer, _ 	<OutAttribute> ByRef end1 As UV, _ 	<OutAttribute> ByRef end2 As UV _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void GetSegmentEndPoints( 	int segmentId,  	int regionId,  	[OutAttribute] UV^% end1,  	[OutAttribute] UV^% end2 ) ``` |

#### Parameters

segmentId
:   Type:  System Int32
     The segment id.

regionId
:   Type:  System Int32
     The region id.

end1
:   Type:  Autodesk.Revit.DB UV   %
     One end point.

end2
:   Type:  Autodesk.Revit.DB UV   %
     The other end point.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The segment id is invalid. |
| Autodesk.Revit.Exceptions InvalidOperationException | This operation is valid only for vertically compound structures. |

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### RebarShapeId Property

---

|  |
| --- |
| RebarContainerItem Class   See Also |

The RebarShape element that defines the shape of the rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public ElementId RebarShapeId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RebarShapeId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ RebarShapeId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

Changing the value of this property causes the Rebar instance to choose values for its shape parameters to preserve its previous shape as closely as possible

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: shapeId is not the id of a RebarShape in the document. -or- When setting this property: The RebarShape has End Treatments |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### TwoLineRiseType Property

---

|  |
| --- |
| PipingSystemType Class   See Also |

Symbol for a 2 line rise

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public RiseDropSymbol TwoLineRiseType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TwoLineRiseType As RiseDropSymbol 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property RiseDropSymbol TwoLineRiseType { 	RiseDropSymbol get (); 	void set (RiseDropSymbol value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The input is not a valid piping rise/drop symbol type. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PipingSystemType Class

Autodesk.Revit.DB.Plumbing Namespace

#### Dispose Method

---

|  |
| --- |
| Subelement Class   See Also |

Releases all resources used by the  Subelement

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

Subelement Class

Autodesk.Revit.DB Namespace

#### Finish Method

---

|  |
| --- |
| BRepBuilder Class   See Also |

Complete construction of the geometry. The geometry will be validated and, if valid, stored in this Builder. Otherwise it will be deleted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public BRepBuilderOutcome Finish() ``` |

| Visual Basic |
| --- |
| ``` Public Function Finish As BRepBuilderOutcome ``` |

| Visual C++ |
| --- |
| ``` public: BRepBuilderOutcome Finish() ``` |

#### Return Value

BRepBuilderOutcome.Success if successful, BRepBuilderOutcome.Failure otherwise.

# Remarks

If this function returned anything but BRepBuilderOutcome.Success, this BrepBuilder object should be discarded. An attempt to retrieve the built b-rep via GetBRep() will cause an exception to be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error. Consult the State property of the BRepBuilder object for more details. -or- BRep doesn't have enough faces. -or- FinishFace() must be called on all the faces of the BRepBuilder. |

# See Also

BRepBuilder Class

Autodesk.Revit.DB Namespace

#### SectionArea Property

---

|  |
| --- |
| StructuralSectionAnalysisParams Class   See Also |

Cross section area.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double SectionArea { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SectionArea As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double SectionArea { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionAnalysisParams Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### StructuralStickSymbolLocation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Stick Symbol Location"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralStickSymbolLocation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralStickSymbolLocation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralStickSymbolLocation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CutsWall Property

---

|  |
| --- |
| WallSweepInfo Class   See Also |

Indicates if you want the sweep to cut geometry out of the host wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool CutsWall { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CutsWall As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool CutsWall { 	bool get (); 	void set (bool value); } ``` |

# Remarks

When a sweep is offset and embedded in the wall, it cuts the geometry from the wall.

# See Also

WallSweepInfo Class

Autodesk.Revit.DB Namespace

#### RbsLoadSubClassificationMotor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Load Sub-Classification Motor"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsLoadSubClassificationMotor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsLoadSubClassificationMotor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsLoadSubClassificationMotor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RoofSlope Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Slope"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoofSlope { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoofSlope As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoofSlope { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BorderAroundSchedule Property

---

|  |
| --- |
| PanelScheduleData Class   See Also |

Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId BorderAroundSchedule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property BorderAroundSchedule As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ BorderAroundSchedule { 	ElementId^ get (); } ``` |

# See Also

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace

#### CurtainGridBaseOrientation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Grid Base Orientation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurtainGridBaseOrientation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtainGridBaseOrientation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurtainGridBaseOrientation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsBarMatchedWithShapeInReverseOrder Method

---

|  |
| --- |
| RebarFreeFormAccessor Class   See Also |

Checks if the bar at index barPositionIndex it's matched in reversed order with its shape.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool IsBarMatchedWithShapeInReverseOrder( 	int barPositionIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsBarMatchedWithShapeInReverseOrder ( _ 	barPositionIndex As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsBarMatchedWithShapeInReverseOrder( 	int barPositionIndex ) ``` |

#### Parameters

barPositionIndex
:   Type:  System Int32
     An index between 0 and (NumberOfBarPositions-1).

#### Return Value

Returns true if the bar is matched in reversed order with its shape, false otherwise.

# Remarks

If this Rebar has Workshop Instructions set to Straight will return false for all barPositionIndex between 0 and (NumberOfBarPositions-1).

If this Rebar has Workshop Instructions set to Bent there are different cases:

* All bars are matched exactly with a shape. In this case will return false for all barPositionIndex between 0 and (NumberOfBarPositions-1).
* All bars are matched in reversed order with a shape. In this case the Rebar will be reversed and will return false for all barPositionIndex between 0 and (NumberOfBarPositions-1).
* Some bars are matched in reversed order and the others are matched exactly with a shape. For the bars matched in reversed order will return true and for the others will return false

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. |

# See Also

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace

#### FabricationPartCannotChangeTypeMisalignedUnConnError Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type has a problem with the angle dimension of the current fitting(s), resulting in bad geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartCannotChangeTypeMisalignedUnConnError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartCannotChangeTypeMisalignedUnConnError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartCannotChangeTypeMisalignedUnConnError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### DistributionSysTypeSet Class

---

|  |
| --- |
| Members   See Also |

A set that contains DistributionSys types.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class DistributionSysTypeSet : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class DistributionSysTypeSet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class DistributionSysTypeSet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB.Electrical DistributionSysTypeSet

# See Also

DistributionSysTypeSet Members

Autodesk.Revit.DB.Electrical Namespace

#### GetBendData Method

---

|  |
| --- |
| RebarInSystem Class   See Also |

Gets the RebarBendData, containing bar and hook information, of the instance.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public RebarBendData GetBendData() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBendData As RebarBendData ``` |

| Visual C++ |
| --- |
| ``` public: RebarBendData^ GetBendData() ``` |

# Remarks

Internally, the bend data is used by many RebarShape methods to generate shape geometry.

# See Also

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace

#### CannotConvertTempToDouble Property

---

|  |
| --- |
| BuiltInFailures ConversionFailures Class   See Also |

Cannot convert temperature '[Temperate Value]' to double value

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotConvertTempToDouble { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotConvertTempToDouble As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotConvertTempToDouble { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ConversionFailures Class

Autodesk.Revit.DB Namespace

#### CalculateLinesPerLength Method

---

|  |
| --- |
| FillGrid Class   See Also |

Calculates the number of solid lines of the pattern per unit length.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double CalculateLinesPerLength() ``` |

| Visual Basic |
| --- |
| ``` Public Function CalculateLinesPerLength As Double ``` |

| Visual C++ |
| --- |
| ``` public: double CalculateLinesPerLength() ``` |

#### Return Value

The solid lines per length.

# See Also

FillGrid Class

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| RevitServerModelAlreadyExistsException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

RevitServerModelAlreadyExistsException Class

Autodesk.Revit.Exceptions Namespace

#### TextureScaleLock Property

---

|  |
| --- |
| UnifiedBitmap Class   See Also |

The property labeled "Scale Lock" from the "UnifiedBitmap" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static string TextureScaleLock { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureScaleLock As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureScaleLock { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

UnifiedBitmap Class

Autodesk.Revit.DB.Visual Namespace

#### FamilyId Property

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

In a note block schedule, the ID of the Generic Annotation family displayed by the schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId FamilyId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FamilyId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ FamilyId { 	ElementId^ get (); } ``` |

# Remarks

A note block is a schedule of the Generic Annotations category that shows elements of a single family rather than all elements in the category.

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### DissolveForms Method (Document, ICollection(ElementId), ICollection(ElementId))

---

|  |
| --- |
| FormUtils Class   See Also |

Dissolves a collection of form elements into their defining elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> DissolveForms( 	Document ADoc, 	ICollection<ElementId> elements, 	out ICollection<ElementId> ProfileOriginPointSet ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function DissolveForms ( _ 	ADoc As Document, _ 	elements As ICollection(Of ElementId), _ 	<OutAttribute> ByRef ProfileOriginPointSet As ICollection(Of ElementId) _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ DissolveForms( 	Document^ ADoc,  	ICollection<ElementId^>^ elements,  	[OutAttribute] ICollection<ElementId^>^% ProfileOriginPointSet ) ``` |

#### Parameters

ADoc
:   Type:  Autodesk.Revit.DB Document
     The document

elements
:   Type:  System.Collections.Generic ICollection   ElementId
     A collection of element IDs of Forms and GeomCombinations that contain Forms that will be dissolved.

ProfileOriginPointSet
:   Type:  System.Collections.Generic ICollection   ElementId   %
     A collection of the point element ids that represent the 'origin' of the profiles

#### Return Value

A collection of curve element ids from the profiles and paths of the dissolved forms.

# Remarks

Profile origin points define the workplane of form profiles and paths and their curves. The profile origin point represents a coordinate system with an origin (reference point) which can be manipulated to move the curves of a profile together as a unit after dissolve. Profile origin points may themselves be constrained to other parts of the model or parts of the form, based on how the form was created/constructed. This is done through the reference point hosting mechanism.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The elements do not include Forms that can be dissolved. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FormUtils Class

DissolveForms Overload

Autodesk.Revit.DB Namespace

#### RulingsAreParallel Property

---

|  |
| --- |
| RuledFace Class   See Also |

Determines if the rulings of this ruled surface are parallel.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool RulingsAreParallel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property RulingsAreParallel As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool RulingsAreParallel { 	bool get (); } ``` |

# See Also

RuledFace Class

Autodesk.Revit.DB Namespace

#### WallNotCoveredByRoof Property

---

|  |
| --- |
| BuiltInFailures WallJoinRoofFailures Class   See Also |

The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WallNotCoveredByRoof { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallNotCoveredByRoof As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WallNotCoveredByRoof { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallJoinRoofFailures Class

Autodesk.Revit.DB Namespace

#### TreadNosingPosition Enumeration

---

|  |
| --- |
| See Also |

Represents on which edges of the nosing to apply the nosing profile.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum TreadNosingPosition ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TreadNosingPosition ``` |

| Visual C++ |
| --- |
| ``` public enum class TreadNosingPosition ``` |

# Members

| Member name | Description |
| --- | --- |
| FrontOnly | Adds nosing on the front edge of tread only. |
| FrontAndLeft | Adds nosing on the front and left edge of tread. |
| FrontAndRight | Adds nosing on the front and right edge of tread. |
| FrontLeftAndRight | Adds nosing on the front left and left edge of tread. |

# See Also

Autodesk.Revit.DB.Architecture Namespace

#### BuiltInFailures.SweptBlendFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about SweptBlend.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class SweptBlendFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class SweptBlendFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class SweptBlendFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures SweptBlendFailures

# See Also

BuiltInFailures SweptBlendFailures Members

Autodesk.Revit.DB Namespace

#### NewtonSecondsPerSquareMeter Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Newton seconds per square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId NewtonSecondsPerSquareMeter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NewtonSecondsPerSquareMeter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ NewtonSecondsPerSquareMeter { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### GetSurfaceDistance Method

---

|  |
| --- |
| DefaultDivideSettings Class   See Also |

Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double GetSurfaceDistance( 	UVGridlineType gridlines ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSurfaceDistance ( _ 	gridlines As UVGridlineType _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetSurfaceDistance( 	UVGridlineType gridlines ) ``` |

#### Parameters

gridlines
:   Type:  Autodesk.Revit.DB UVGridlineType
     U-gridlines or V-gridlines.

#### Return Value

The default distance for the layout.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DefaultDivideSettings Class

Autodesk.Revit.DB Namespace

#### LoadAttrMomentArrowArc Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Moment arrowhead"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadAttrMomentArrowArc { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadAttrMomentArrowArc As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadAttrMomentArrowArc { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CanChangeFamilyName Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

Checks whether the DirectShapeType supports a custom family name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool CanChangeFamilyName() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanChangeFamilyName As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanChangeFamilyName() ``` |

#### Return Value

True if a custom family name is supported, false otherwise.

# See Also

DirectShapeType Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32, Double, Double, ElementId, ElementId)

---

|  |
| --- |
| RebarShape Class   See Also |

Create a new instance of a Rebar Shape, which defines the shape of a rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static RebarShape Create( 	Document doc, 	RebarShapeDefinition definition, 	RebarShapeMultiplanarDefinition multiplanarDefinition, 	RebarStyle style, 	StirrupTieAttachmentType attachmentType, 	int startHookAngle, 	RebarHookOrientation startHookOrientation, 	int endHookAngle, 	RebarHookOrientation endHookOrientation, 	int higherEnd, 	double hookRotationAngleAtStart, 	double hookRotationAngleAtEnd, 	ElementId endTreatmentTypeIdAtStart, 	ElementId endTreatmentTypeIdAtEnd ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	doc As Document, _ 	definition As RebarShapeDefinition, _ 	multiplanarDefinition As RebarShapeMultiplanarDefinition, _ 	style As RebarStyle, _ 	attachmentType As StirrupTieAttachmentType, _ 	startHookAngle As Integer, _ 	startHookOrientation As RebarHookOrientation, _ 	endHookAngle As Integer, _ 	endHookOrientation As RebarHookOrientation, _ 	higherEnd As Integer, _ 	hookRotationAngleAtStart As Double, _ 	hookRotationAngleAtEnd As Double, _ 	endTreatmentTypeIdAtStart As ElementId, _ 	endTreatmentTypeIdAtEnd As ElementId _ ) As RebarShape ``` |

| Visual C++ |
| --- |
| ``` public: static RebarShape^ Create( 	Document^ doc,  	RebarShapeDefinition^ definition,  	RebarShapeMultiplanarDefinition^ multiplanarDefinition,  	RebarStyle style,  	StirrupTieAttachmentType attachmentType,  	int startHookAngle,  	RebarHookOrientation startHookOrientation,  	int endHookAngle,  	RebarHookOrientation endHookOrientation,  	int higherEnd,  	double hookRotationAngleAtStart,  	double hookRotationAngleAtEnd,  	ElementId^ endTreatmentTypeIdAtStart,  	ElementId^ endTreatmentTypeIdAtEnd ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     A document to contain the RebarShape.

definition
:   Type:  Autodesk.Revit.DB.Structure RebarShapeDefinition
     The definition of the rebar shape, as a set of curves in a plane driven by parameters.

multiplanarDefinition
:   Type:  Autodesk.Revit.DB.Structure RebarShapeMultiplanarDefinition
     If not    a null reference (  Nothing  in Visual Basic)  , the created RebarShape will be a 3D shape. The shape is built out of the planar RebarShapeDefinition, with additional out-of-plane segments defined by the RebarShapeMultiplanarDefinition object. Not supported in conjunction with RebarShapeDefinitionByArc of type Spiral or LappedCircle.

style
:   Type:  Autodesk.Revit.DB.Structure RebarStyle
     Whether the shape is to be used as a standard bar or a stirrup/tie.

attachmentType
:   Type:  Autodesk.Revit.DB.Structure StirrupTieAttachmentType
     When the style is stirrup/tie, specify whether it will attach to the interior of cover (cover is measured to the stirrups), or to the exterior of cover (cover is measured to the standard bars). Ignored when the style is Standard.

startHookAngle
:   Type:  System Int32
     The start hook angle, expressed as an integral number of degrees. If 0, the shape will have no start hook. Common values are 0, 90, 135, and 180.

startHookOrientation
:   Type:  Autodesk.Revit.DB.Structure RebarHookOrientation
     The orientation of the start hook. Ignored when startHookAngle is 0.

endHookAngle
:   Type:  System Int32
     The end hook angle, expressed as an integral number of degrees. If 0, the shape will have no end hook. Common values are 0, 90, 135, and 180.

endHookOrientation
:   Type:  Autodesk.Revit.DB.Structure RebarHookOrientation
     The orientation of the end hook. Ignored when endHookAngle is 0.

higherEnd
:   Type:  System Int32
     When the rebar crosses itself, one end will be "lifted" to avoid self-intersection. Specify which end should be lifted: 0 for start, 1 for end.

hookRotationAngleAtStart
:   Type:  System Double
     The out of plane hook rotation angle at the start of the bar.

hookRotationAngleAtEnd
:   Type:  System Double
     The out of plane hook rotation angle at the end of the bar.

endTreatmentTypeIdAtStart
:   Type:  Autodesk.Revit.DB ElementId
     The end treatment type id at the start of the bar.

endTreatmentTypeIdAtEnd
:   Type:  Autodesk.Revit.DB ElementId
     The end treatment type id at the end of the bar.

#### Return Value

A new RebarShape instance.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | definition is linked to a Document other than doc. -or- A multiplanar definition is specified when the given RebarShapeDefinition does not support it. The following RebarShapeDefinitions do not support multiplanar: a simple line; spiral; lapped circle. -or- The DepthParamId property of multiplanarDefinition is invalid or has not been added to definition. -or- the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element. -or- the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | startHookAngle must be at least 0 and no more than 180. -or- endHookAngle must be at least 0 and no more than 180. -or- higherEnd must be 0 or 1. -or- A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarShape Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### OwnerGroup Property

---

|  |
| --- |
| ExternalDefinition Class   See Also |

Returns or change the group ID of the external parameter definition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual DefinitionGroup OwnerGroup { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property OwnerGroup As DefinitionGroup 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property DefinitionGroup^ OwnerGroup { 	DefinitionGroup^ get (); 	void set (DefinitionGroup^ value); } ``` |

# Remarks

If failed When set the group, an InvalidOperationException will be thrown.

# See Also

ExternalDefinition Class

Autodesk.Revit.DB Namespace

#### GetIndexStreamPoint Method

---

|  |
| --- |
| IndexBuffer Class   See Also |

Gets a stream that can be used to write  IndexPoint  primitives into the buffer.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public IndexStreamPoint GetIndexStreamPoint() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetIndexStreamPoint As IndexStreamPoint ``` |

| Visual C++ |
| --- |
| ``` public: IndexStreamPoint^ GetIndexStreamPoint() ``` |

#### Return Value

The stream that can be used to write into this buffer.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space. |

# See Also

IndexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### BadBalustersPerTread Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Number of Balusters per Tread must be an integer greater than zero.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BadBalustersPerTread { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BadBalustersPerTread As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BadBalustersPerTread { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### FamilyCurveGstylePlusInvisibleMinusAnalytical Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Subcategory"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FamilyCurveGstylePlusInvisibleMinusAnalytical { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyCurveGstylePlusInvisibleMinusAnalytical As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FamilyCurveGstylePlusInvisibleMinusAnalytical { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CloneFailureMessage Method

---

|  |
| --- |
| FailureMessageAccessor Class   See Also |

Creates a copy of the FailureMessage.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureMessage CloneFailureMessage() ``` |

| Visual Basic |
| --- |
| ``` Public Function CloneFailureMessage As FailureMessage ``` |

| Visual C++ |
| --- |
| ``` public: FailureMessage^ CloneFailureMessage() ``` |

#### Return Value

Copy of the FailureMesassge.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace

#### WrongConstraintInTrussSketch Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Structural Truss sketch can't be constrained to its members.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WrongConstraintInTrussSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WrongConstraintInTrussSketch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WrongConstraintInTrussSketch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### ProjectRevisionEnumeration Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Numbering"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ProjectRevisionEnumeration { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ProjectRevisionEnumeration As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ProjectRevisionEnumeration { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidReferenceName Method

---

|  |
| --- |
| DirectShapeReferenceOptions Class   See Also |

Validates that the input name can be assigned to a direct shape reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static bool IsValidReferenceName( 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidReferenceName ( _ 	name As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidReferenceName( 	String^ name ) ``` |

#### Parameters

name
:   Type:  System String
     The name to assign to the reference.

#### Return Value

True if the input name is valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShapeReferenceOptions Class

Autodesk.Revit.DB Namespace

#### ZoomType Property

---

|  |
| --- |
| PDFExportOptions Class   See Also |

Zoom type of either fit to page or on a specific percentage.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public ZoomType ZoomType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ZoomType As ZoomType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ZoomType ZoomType { 	ZoomType get (); 	void set (ZoomType value); } ``` |

# Remarks

This property would be ignored if the PaperFormat is Default.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PDFExportOptions Class

Autodesk.Revit.DB Namespace

#### CanSuppressFirstOrLastBar Method

---

|  |
| --- |
| Rebar Class   See Also |

Checks if the first or last bar in rebar set can be hidden in the given view.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool CanSuppressFirstOrLastBar( 	View dBView, 	int end ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanSuppressFirstOrLastBar ( _ 	dBView As View, _ 	end As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanSuppressFirstOrLastBar( 	View^ dBView,  	int end ) ``` |

#### Parameters

dBView
:   Type:  Autodesk.Revit.DB View
     The view in which presentation mode will be applied.

end
:   Type:  System Int32
     0 for the first bar in rebar set, 1 for the last bar.

#### Return Value

True the first or last bar in rebar set can be hidden for this view, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### ResultAffectedByCrop Property

---

|  |
| --- |
| BuiltInFailures PathOfTravelFailures Class   See Also |

A crop region is enabled in the view. The Path of Travel may not be the optimized route because it is calculating only inside the crop region. Consider uncropping the view and placing another Path of Travel to ensure you see the optimized route.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ResultAffectedByCrop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ResultAffectedByCrop As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ResultAffectedByCrop { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PathOfTravelFailures Class

Autodesk.Revit.DB Namespace

#### ConvertLights Property

---

|  |
| --- |
| NavisworksExportOptions Class   See Also |

True to convert lights, false otherwise. Default value is false.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public bool ConvertLights { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ConvertLights As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ConvertLights { 	bool get (); 	void set (bool value); } ``` |

# See Also

NavisworksExportOptions Class

Autodesk.Revit.DB Namespace

#### HeadOnPlacementMethod Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Draw in Foreground"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId HeadOnPlacementMethod { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HeadOnPlacementMethod As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ HeadOnPlacementMethod { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CanHaveAnnotationCrop Property

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Verifies that the view is allowed to have an annotation crop.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool CanHaveAnnotationCrop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CanHaveAnnotationCrop As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool CanHaveAnnotationCrop { 	bool get (); } ``` |

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### SetGlobal2DDirectionHandles Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Sets the handles representing the cardinal directions in 2D.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static void SetGlobal2DDirectionHandles( 	bool positive, 	IFCAnyHandle xDir, 	IFCAnyHandle yDir ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub SetGlobal2DDirectionHandles ( _ 	positive As Boolean, _ 	xDir As IFCAnyHandle, _ 	yDir As IFCAnyHandle _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void SetGlobal2DDirectionHandles( 	bool positive,  	IFCAnyHandle^ xDir,  	IFCAnyHandle^ yDir ) ``` |

#### Parameters

positive
:   Type:  System Boolean
     True if the handles returned should be in the positive direction, false if the handles should be in the negative direction.

xDir
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The X direction handle.

yDir
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The Y direction handle.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### DimensionShape Enumeration

---

|  |
| --- |
| See Also |

An enumerated type to list dimension type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum DimensionShape ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DimensionShape ``` |

| Visual C++ |
| --- |
| ``` public enum class DimensionShape ``` |

# Members

| Member name | Description |
| --- | --- |
| Linear | Linear dimension. |
| Angular | Angular dimension. |
| Radial | Radial dimension. |
| ArcLength | ArcLength dimension. |
| Spot | Spot dimension. |
| Diameter | Diameter dimension. |
| Unknown | Unknown type dimension. |

# See Also

Autodesk.Revit.DB Namespace

#### CanHaveShape Property

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Verifies that the crop of the associated view is permitted to have a non-rectangular shape.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool CanHaveShape { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CanHaveShape As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool CanHaveShape { 	bool get (); } ``` |

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### AreWorkshopInstructionsChanged Property

---

|  |
| --- |
| RebarUpdateCurvesData Class   See Also |

Indicates if the workshop instructions have changed since the last regeneration.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool AreWorkshopInstructionsChanged { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property AreWorkshopInstructionsChanged As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool AreWorkshopInstructionsChanged { 	bool get (); } ``` |

# See Also

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace

#### GetAdditionalElements Method

---

|  |
| --- |
| FailureMessage Class   See Also |

Retrieves list of the additional reference elements for the failure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetAdditionalElements() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAdditionalElements As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetAdditionalElements() ``` |

#### Return Value

The additional elements.

# See Also

FailureMessage Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| LeaderArray Class   See Also |

Test to see if the array is empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the array is empty then True will be returned, otherwise False.

# See Also

LeaderArray Class

Autodesk.Revit.DB Namespace

#### CanRodsBeHosted Property

---

|  |
| --- |
| FabricationRodInfo Class   See Also |

Controls whether the hanger's rod's will be automatically hosted by other elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool CanRodsBeHosted { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CanRodsBeHosted As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool CanRodsBeHosted { 	bool get (); 	void set (bool value); } ``` |

# See Also

FabricationRodInfo Class

Autodesk.Revit.DB Namespace

#### ShapeImporter Constructor

---

|  |
| --- |
| ShapeImporter Class   See Also |

Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public ShapeImporter() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ShapeImporter() ``` |

# See Also

ShapeImporter Class

Autodesk.Revit.DB Namespace

#### StairsTopEndExceedsOrNotReachWarning Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Stair top end exceeds or cannot reach the top elevation of the stair. Add/remove risers at the top end or change top elevation settings in Stair Properties.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StairsTopEndExceedsOrNotReachWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsTopEndExceedsOrNotReachWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StairsTopEndExceedsOrNotReachWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### GetSeverity Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

Provides access to the current failure severity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureSeverity GetSeverity() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSeverity As FailureSeverity ``` |

| Visual C++ |
| --- |
| ``` public: FailureSeverity GetSeverity() ``` |

#### Return Value

The highest severity of a failure message currently posted in the document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also

FailuresAccessor Class

Autodesk.Revit.DB Namespace

#### PipePressureDropCalculatorNotAvailable Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

Pipe Pressure Drop Calculator Not Available: [Calculator Name]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PipePressureDropCalculatorNotAvailable { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PipePressureDropCalculatorNotAvailable As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PipePressureDropCalculatorNotAvailable { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### StartNumber Property

---

|  |
| --- |
| NumericRevisionSettings Class   See Also |

The start number for the sequence.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public int StartNumber { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property StartNumber As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int StartNumber { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for number is negative. |

# See Also

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace

#### Name Property

---

|  |
| --- |
| BaseArray Class   See Also |

Get and Set the Name property

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override string Name { set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overrides WriteOnly Property Name As String 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property String^ Name { 	void set (String^ value) override; } ``` |

# Remarks

The method set is override to forbid the user to change the Name. When the user tries to call the method set for BaseArray object, an InvalidOperationException will be thrown.

# See Also

BaseArray Class

Autodesk.Revit.DB Namespace

#### TypeId Property

---

|  |
| --- |
| TextNoteOptions Class   See Also |

Id of a text type that defines the style of a text note.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public ElementId TypeId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TypeId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ TypeId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

No default value. A valid type element Id must be set prior using the options. The text type allows its font name parameter to be set to a font unavailable on the current system. However, any text note created with or set to this font type will be displayed in a default substituted font (e.g. Arial) and the UI will show a blank value in the text type font name parameter. Once the document is opened on a system which has the font set on the text type, the text note will display with that font and the UI will show that font in the text type font name parameter.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

TextNoteOptions Class

Autodesk.Revit.DB Namespace

#### SetCutLayerModifiers Method

---

|  |
| --- |
| ExportLayerInfo Class   See Also |

Sets a cut layer modifier array to the layer info.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetCutLayerModifiers( 	IList<LayerModifier> cutLayermodifiers ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetCutLayerModifiers ( _ 	cutLayermodifiers As IList(Of LayerModifier) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetCutLayerModifiers( 	IList<LayerModifier^>^ cutLayermodifiers ) ``` |

#### Parameters

cutLayermodifiers
:   Type:  System.Collections.Generic IList   LayerModifier
     The cut layer modifier array.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace

#### IsValidApprovalTypeName Method

---

|  |
| --- |
| StructuralConnectionApprovalType Class   See Also |

Verifies if the provided approval name is unique in the document.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static bool IsValidApprovalTypeName( 	Document doc, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidApprovalTypeName ( _ 	doc As Document, _ 	name As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidApprovalTypeName( 	Document^ doc,  	String^ name ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document

name
:   Type:  System String

#### Return Value

True if approval type name is unique.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

StructuralConnectionApprovalType Class

Autodesk.Revit.DB.Structure Namespace

#### MoveNext Method

---

|  |
| --- |
| CurveArrArrayIterator Class   See Also |

Move the iterator one item forward.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool MoveNext() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function MoveNext As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool MoveNext() ``` |

#### Return Value

Returns True if the iterator was successfully moved forward one item and the Current property will return a valid item. False will be returned it the iterator has reached the end of the array.

#### Implements

 IEnumerator MoveNext

# Remarks

MoveNext must be called before the Current property is valid with a new or Reset iterator in line with the expected behavior of IEnumerator.

# See Also

CurveArrArrayIterator Class

Autodesk.Revit.DB Namespace

#### IfcExportElementAs Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Export to IFC As"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId IfcExportElementAs { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IfcExportElementAs As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ IfcExportElementAs { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ConnectionValidationInfo Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace

#### Water Class

---

|  |
| --- |
| Members   See Also |

A static class that provides access to the property names that appear in the Water visual asset schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static class Water ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class Water ``` |

| Visual C++ |
| --- |
| ``` public ref class Water abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual Water

# See Also

Water Members

Autodesk.Revit.DB.Visual Namespace

#### CreateTransformed Method

---

|  |
| --- |
| Curve Class   See Also |

Crates a new instance of a curve as a transformation of this curve.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public Curve CreateTransformed( 	Transform transform ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CreateTransformed ( _ 	transform As Transform _ ) As Curve ``` |

| Visual C++ |
| --- |
| ``` public: Curve^ CreateTransformed( 	Transform^ transform ) ``` |

#### Parameters

transform
:   Type:  Autodesk.Revit.DB Transform
     The transform to apply.

#### Return Value

The new curve.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | transform is not conformal. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |

# See Also

Curve Class

Autodesk.Revit.DB Namespace

#### AppendItemFromCurvesAndShape Method

---

|  |
| --- |
| RebarContainer Class   See Also |

Appends an Item to the RebarContainer. Fills its data on base of the Rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public RebarContainerItem AppendItemFromCurvesAndShape( 	RebarShape rebarShape, 	RebarBarType barType, 	RebarHookType startHook, 	RebarHookType endHook, 	XYZ normal, 	IList<Curve> curves, 	RebarHookOrientation startHookOrient, 	RebarHookOrientation endHookOrient ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AppendItemFromCurvesAndShape ( _ 	rebarShape As RebarShape, _ 	barType As RebarBarType, _ 	startHook As RebarHookType, _ 	endHook As RebarHookType, _ 	normal As XYZ, _ 	curves As IList(Of Curve), _ 	startHookOrient As RebarHookOrientation, _ 	endHookOrient As RebarHookOrientation _ ) As RebarContainerItem ``` |

| Visual C++ |
| --- |
| ``` public: RebarContainerItem^ AppendItemFromCurvesAndShape( 	RebarShape^ rebarShape,  	RebarBarType^ barType,  	RebarHookType^ startHook,  	RebarHookType^ endHook,  	XYZ^ normal,  	IList<Curve^>^ curves,  	RebarHookOrientation startHookOrient,  	RebarHookOrientation endHookOrient ) ``` |

#### Parameters

rebarShape
:   Type:  Autodesk.Revit.DB.Structure RebarShape
     A RebarShape element that defines the shape of the rebar. A RebarShape element matches curves and hooks. A RebarShape element provides RebarStyle of the rebar.

barType
:   Type:  Autodesk.Revit.DB.Structure RebarBarType
     A RebarBarType element that defines bar diameter, bend radius and material of the rebar.

startHook
:   Type:  Autodesk.Revit.DB.Structure RebarHookType
     A RebarHookType element that defines the hook for the start of the bar. If this parameter is    a null reference (  Nothing  in Visual Basic)  , it means to create a rebar with no hook.

endHook
:   Type:  Autodesk.Revit.DB.Structure RebarHookType
     A RebarHookType element that defines the hook for the end of the bar. If this parameter is    a null reference (  Nothing  in Visual Basic)  , it means to create a rebar with no hook.

normal
:   Type:  Autodesk.Revit.DB XYZ
     The normal to the plane that the rebar curves lie on.

curves
:   Type:  System.Collections.Generic IList   Curve
     An array of curves that define the shape of the rebar curves. They must belong to the plane defined by the normal and origin. Bends and hooks should not be included in the array of curves.

startHookOrient
:   Type:  Autodesk.Revit.DB.Structure RebarHookOrientation
     Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."

endHookOrient
:   Type:  Autodesk.Revit.DB.Structure RebarHookOrientation
     Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."

#### Return Value

The Rebar Container Item.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input curves is empty. -or- The input curves contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- curves do not form a valid CurveLoop. -or- The input curves contains at least one helical curve and is not supported for this operation. -or- The rebarShape has End Treatments |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | normal has zero length. -or- A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | curves contains non-fillet arcs with radii that are less than the minimum bend radius for the RebarBarType and RebarShape style. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | rebarShape does not match curves. |

# See Also

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace

#### FabricationProductDataLongDescription Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Product Long Description"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationProductDataLongDescription { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationProductDataLongDescription As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationProductDataLongDescription { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PathReinforcementWrongHost Property

---

|  |
| --- |
| BuiltInFailures RebarSystemFailures Class   See Also |

Path Reinforcement can be placed only in Structural Floors and straight Structural Walls.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PathReinforcementWrongHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinforcementWrongHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PathReinforcementWrongHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarSystemFailures Class

Autodesk.Revit.DB Namespace

#### Id Property

---

|  |
| --- |
| TaskDialog Class   See Also |

The Id of the task dialog.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string Id { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Id As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Id { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

Id is used as follows:

* TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events
* As part of the Contextual Help Topic when invoking Revit contextual help

# See Also

TaskDialog Class

Autodesk.Revit.UI Namespace

#### SymbolicCurveArrayIterator Constructor

---

|  |
| --- |
| SymbolicCurveArrayIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SymbolicCurveArrayIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: SymbolicCurveArrayIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

SymbolicCurveArrayIterator Class

Autodesk.Revit.DB Namespace

#### GridBankColWidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Column Distance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GridBankColWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GridBankColWidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GridBankColWidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NewSweep Method (Boolean, ReferenceArray, SweepProfile, Int32, ProfilePlaneLocation)

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Adds a new sweep form into the family document, using an array of selected references as a 3D path.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Sweep NewSweep( 	bool isSolid, 	ReferenceArray path, 	SweepProfile profile, 	int profileLocationCurveIndex, 	ProfilePlaneLocation profilePlaneLocation ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewSweep ( _ 	isSolid As Boolean, _ 	path As ReferenceArray, _ 	profile As SweepProfile, _ 	profileLocationCurveIndex As Integer, _ 	profilePlaneLocation As ProfilePlaneLocation _ ) As Sweep ``` |

| Visual C++ |
| --- |
| ``` public: Sweep^ NewSweep( 	bool isSolid,  	ReferenceArray^ path,  	SweepProfile^ profile,  	int profileLocationCurveIndex,  	ProfilePlaneLocation profilePlaneLocation ) ``` |

#### Parameters

isSolid
:   Type:  System Boolean
     Indicates if the Sweep is Solid or Void.

path
:   Type:  Autodesk.Revit.DB ReferenceArray
     The path of the sweep. The path should be reference of curve or edge obtained from existing geometry.

profile
:   Type:  Autodesk.Revit.DB SweepProfile
     The profile to create the new Sweep. The profile must lie in the XY plane, and it will be transformed to the profile plane automatically. This may contain more than one curve loop or a profile family. Each loop must be a fully closed curve loop and the loops must not intersect. The loop can be a unbound circle or ellipse, but its geometry will be split in two in order to satisfy requirements for sketches used in extrusions.

profileLocationCurveIndex
:   Type:  System Int32
     The index of the path curves. The curve upon which the profile plane will be determined.

profilePlaneLocation
:   Type:  Autodesk.Revit.DB ProfilePlaneLocation
     The location on the profileLocationCurve where the profile plane will be determined.

#### Return Value

If creation was successful the new Sweep is returned, otherwise an exception with failure information will be thrown.

# Remarks

This method creates a sweep in a family document. The sweep will trace the profile along the path.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input argument-path-is    a null reference (  Nothing  in Visual Basic)  or empty or an unsupported curve type. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument-profile-is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument-profileLocationCurveIndex-is out of index bounds. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument-profilePlaneLocation-does not exist in the ProfilePlaneLocation enumeration. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the creation failed. |

# See Also

FamilyItemFactory Class

NewSweep Overload

Autodesk.Revit.Creation Namespace

#### Justification Property

---

|  |
| --- |
| SpacingRule Class   See Also |

The justification of the lines within the region.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SpacingRuleJustification Justification { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Justification As SpacingRuleJustification 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property SpacingRuleJustification Justification { 	SpacingRuleJustification get (); 	void set (SpacingRuleJustification value); } ``` |

# Remarks

This property is only available when  Layout  is equal to FixedDistance, FixedNumber, MaximumSpacing, or MinimumSpacing.

# See Also

SpacingRule Class

Autodesk.Revit.DB Namespace

#### FabricAreaOutSideOfHost Property

---

|  |
| --- |
| BuiltInFailures FabricAreaFailures Class   See Also |

Fabric Area is sketched completely outside of its host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricAreaOutSideOfHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricAreaOutSideOfHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricAreaOutSideOfHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricAreaFailures Class

Autodesk.Revit.DB Namespace

#### AddReferencePlane Method (Plane, BoundingBoxUV, DirectShapeReferenceOptions)

---

|  |
| --- |
| DirectShape Class   See Also |

Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void AddReferencePlane( 	Plane refPlane, 	BoundingBoxUV boundingBoxUV, 	DirectShapeReferenceOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddReferencePlane ( _ 	refPlane As Plane, _ 	boundingBoxUV As BoundingBoxUV, _ 	options As DirectShapeReferenceOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddReferencePlane( 	Plane^ refPlane,  	BoundingBoxUV^ boundingBoxUV,  	DirectShapeReferenceOptions^ options ) ``` |

#### Parameters

refPlane
:   Type:  Autodesk.Revit.DB Plane
     The geometry of the new reference plane.

boundingBoxUV
:   Type:  Autodesk.Revit.DB BoundingBoxUV
     If boundingBoxUV is set, the resulting reference plane that is added to the DirectShape will be displayed with those bounds. Note that the specified bounds must not be degenerate. If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane. The automatic bounds are based on the host direct shape's geometry.

options
:   Type:  Autodesk.Revit.DB DirectShapeReferenceOptions
     The options that are used to configure the new reference plane.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShape Class

AddReferencePlane Overload

Autodesk.Revit.DB Namespace

#### UpdaterRegistry Class

---

|  |
| --- |
| Members   See Also |

An object that stores and manages all updaters registered in the current session.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class UpdaterRegistry : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class UpdaterRegistry _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class UpdaterRegistry : IDisposable ``` |

# Remarks

The registry is an application-wide singleton. It maintains all dynamic updaters currently registered, and also invokes them per their respective trigger condition during subsequent transactions.

Please note that only the application (an add-in, typically) which registered an updater is allowed to modify it later, including unregistering it. Also, an application is not allowed to register an updater with an Id, that is based on another application's Id.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB UpdaterRegistry

# See Also

UpdaterRegistry Members

Autodesk.Revit.DB Namespace

#### CannotPasteCircularLinks Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

The pasted selection includes a linked instance of this file '[Name]'. A file cannot link itself, so the link was not pasted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotPasteCircularLinks { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotPasteCircularLinks As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotPasteCircularLinks { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### AllModelInstanceComments Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Comments"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AllModelInstanceComments { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AllModelInstanceComments As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AllModelInstanceComments { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TextureVRepeat Property

---

|  |
| --- |
| UnifiedBitmap Class   See Also |

The property labeled "V Repeat" from the "UnifiedBitmap" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static string TextureVRepeat { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureVRepeat As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureVRepeat { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

UnifiedBitmap Class

Autodesk.Revit.DB.Visual Namespace

#### GetHostId Method

---

|  |
| --- |
| RebarUpdateCurvesData Class   See Also |

Gets the id of the host structural for this rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public ElementId GetHostId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHostId As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetHostId() ``` |

#### Return Value

Returns the id of the host structural for this rebar.

# See Also

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace

#### DocumentPrinting Event

---

|  |
| --- |
| ControlledApplication Class   See Also |

Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentPrintingEventArgs> DocumentPrinting ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentPrinting As EventHandler(Of DocumentPrintingEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentPrintingEventArgs^>^ DocumentPrinting { 	void add (EventHandler<DocumentPrintingEventArgs^>^ value); 	void remove (EventHandler<DocumentPrintingEventArgs^>^ value); } ``` |

# Remarks

This event is raised when Revit is just about to print a view or ViewSet of the document.

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.

The following API functions are not available for current document during this event:

* All overloads of Autodesk.Revit.DB.Document.Export()
* Autodesk::Revit::DB::Document::Print
* Print  and similar overloads.
* SubmitPrint  and similar overloads.
* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

After this event, for each view being printed,  ViewPrinting  and  ViewPrinted  events will be raised. Another event  DocumentPrinted  will be raised immediately after document printing is finished.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### GetAllUnits Method

---

|  |
| --- |
| UnitUtils Class   See Also |

Gets the identifiers of all available units.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static IList<ForgeTypeId> GetAllUnits() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetAllUnits As IList(Of ForgeTypeId) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<ForgeTypeId^>^ GetAllUnits() ``` |

#### Return Value

The unit identifiers.

# See Also

UnitUtils Class

Autodesk.Revit.DB Namespace

#### LinearDimType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Dimension String Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LinearDimType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LinearDimType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LinearDimType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InvalidParameters Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Stairs run or landing has invalid parameter(s).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidParameters { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidParameters As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidParameters { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| PanelTypeSet Class   See Also |

Removes every panel type from the set, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

PanelTypeSet Class

Autodesk.Revit.DB Namespace

#### RbsSystemFlowConversionMethodParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Flow Conversion Method"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsSystemFlowConversionMethodParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsSystemFlowConversionMethodParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsSystemFlowConversionMethodParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PlasticvinylPatternAmount Property

---

|  |
| --- |
| PlasticVinyl Class   See Also |

The property labeled "Amount" from the "PlasticVinyl" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string PlasticvinylPatternAmount { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlasticvinylPatternAmount As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ PlasticvinylPatternAmount { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 2".

# See Also

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace

#### StairsMultistoryTopLevelParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Multistory Top Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsMultistoryTopLevelParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsMultistoryTopLevelParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsMultistoryTopLevelParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsEndLevelParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsEndLevelParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsEndLevelParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsEndLevelParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CanExportWallGeometryAsExtrusion Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Identifies if the base geometry of the wall can be represented as an extrusion.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool CanExportWallGeometryAsExtrusion( 	Element element, 	IFCRange range, 	Curve curve ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CanExportWallGeometryAsExtrusion ( _ 	element As Element, _ 	range As IFCRange, _ 	curve As Curve _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool CanExportWallGeometryAsExtrusion( 	Element^ element,  	IFCRange^ range,  	Curve^ curve ) ``` |

#### Parameters

element
:   Type:  Autodesk.Revit.DB Element
     The wall or in-place wall element.

range
:   Type:  Autodesk.Revit.DB.IFC IFCRange
     The range. This consists of two double values representing the height in Z at the start and the end of the range. If the values are identical the entire wall is used.

curve
:   Type:  Autodesk.Revit.DB Curve
     The wall's base curve.

#### Return Value

True if the wall export can be made in the form of an extrusion, false if the geometry cannot be assigned to an extrusion.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### TagHeadPosition Property

---

|  |
| --- |
| IndependentTag Class   See Also |

The position of the head of tag in model coordinates.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ TagHeadPosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TagHeadPosition As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ TagHeadPosition { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

The depth of the tag head position in the view does not matter because tags are drawn over model geometry in the view.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

IndependentTag Class

Autodesk.Revit.DB Namespace

#### GetLightShapeStyle Method

---

|  |
| --- |
| LightFamily Class   See Also |

Returns a LightShapeStyle value for the light shape

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public LightShapeStyle GetLightShapeStyle() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLightShapeStyle As LightShapeStyle ``` |

| Visual C++ |
| --- |
| ``` public: LightShapeStyle GetLightShapeStyle() ``` |

# See Also

LightFamily Class

Autodesk.Revit.DB.Lighting Namespace

#### ModelTextSize Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Text Size"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ModelTextSize { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ModelTextSize As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ModelTextSize { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SurfaceNdfType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "SurfaceNdfType" from the "AdvancedLayered" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum SurfaceNdfType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SurfaceNdfType ``` |

| Visual C++ |
| --- |
| ``` public enum class SurfaceNdfType ``` |

# Members

| Member name | Description |
| --- | --- |
| Beckmann |  |
| Ggx |  |

# See Also

Autodesk.Revit.DB.Visual Namespace

#### ServerPath Property

---

|  |
| --- |
| ModelPath Class   See Also |

Whether this path is a server path (as opposed to a file path or cloud path)

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool ServerPath { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ServerPath As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool ServerPath { 	bool get (); } ``` |

# See Also

ModelPath Class

Autodesk.Revit.DB Namespace

#### NewAngularDimension Method (View, Arc, Reference, Reference)

---

|  |
| --- |
| FamilyItemFactory Class   See Also |

Creates a new angular dimension object using the default dimension type.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Dimension NewAngularDimension( 	View view, 	Arc arc, 	Reference firstRef, 	Reference secondRef ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewAngularDimension ( _ 	view As View, _ 	arc As Arc, _ 	firstRef As Reference, _ 	secondRef As Reference _ ) As Dimension ``` |

| Visual C++ |
| --- |
| ``` public: Dimension^ NewAngularDimension( 	View^ view,  	Arc^ arc,  	Reference^ firstRef,  	Reference^ secondRef ) ``` |

#### Parameters

view
:   Type:  Autodesk.Revit.DB View
     The view in which the dimension is to be visible.

arc
:   Type:  Autodesk.Revit.DB Arc
     The extension arc of the dimension.

firstRef
:   Type:  Autodesk.Revit.DB Reference
     The first geometric reference to which the dimension is to be bound. The reference must be perpendicular to the extension arc.

secondRef
:   Type:  Autodesk.Revit.DB Reference
     The second geometric reference to which the dimension is to be bound. The reference must be perpendicular to the extension arc.

#### Return Value

If creation was successful the new angular dimension is returned, otherwise an exception with failure information will be thrown.

# Remarks

The currently user set default style is used for the created dimension.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when any input argument is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the argument is invalid. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the creation failed. |

# See Also

FamilyItemFactory Class

NewAngularDimension Overload

Autodesk.Revit.Creation Namespace

#### SetFilterOverrides Method

---

|  |
| --- |
| View Class   Example   See Also |

Sets the overrides associated with a filter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetFilterOverrides( 	ElementId filterElementId, 	OverrideGraphicSettings overrideGraphicSettings ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFilterOverrides ( _ 	filterElementId As ElementId, _ 	overrideGraphicSettings As OverrideGraphicSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFilterOverrides( 	ElementId^ filterElementId,  	OverrideGraphicSettings^ overrideGraphicSettings ) ``` |

#### Parameters

filterElementId
:   Type:  Autodesk.Revit.DB ElementId
     ElementId of the filter.

overrideGraphicSettings
:   Type:  Autodesk.Revit.DB OverrideGraphicSettings
     The overrides to apply to the filter.

# Remarks

If the filter is not currently applied to the view, this will add the filter with the assigned overrides.

# Examples

 Copy  C#

```
public static void ModifyExistingFilter(Document doc, View view)
{
    // Find any filter with overrides setting cut color to Red
    Dictionary<ElementId, OverrideGraphicSettings> filterIdsToChange = new Dictionary<ElementId, OverrideGraphicSettings>();

    foreach (ElementId filterId in view.GetFilters())
    {
        OverrideGraphicSettings overrideSettings = view.GetFilterOverrides(filterId);

        Color lineColor = overrideSettings.CutLineColor;

        if (lineColor == Color.InvalidColorValue)
            continue;

        // Save overrides setting the cut color to green
        if (lineColor.Red == 0xFF && lineColor.Green == 0x00 && lineColor.Blue == 0x00)
        {
            overrideSettings.SetCutLineColor(new Color(0x00, 0xFF, 0x00));
            filterIdsToChange[filterId] = overrideSettings;
        }
    }

    // Make the change to all found filters
    using (Transaction t = new Transaction(doc, "Change override filters"))
    {
        t.Start();

        foreach (ElementId filterId in filterIdsToChange.Keys)
        {
            view.SetFilterOverrides(filterId, filterIdsToChange[filterId]);
        }
        t.Commit();
    }
}
```

 Copy  VB.NET

```
Public Shared Sub ModifyExistingFilter(doc As Document, view As View)
    ' Find any filter with overrides setting cut color to Red
    Dim filterIdsToChange As New Dictionary(Of ElementId, OverrideGraphicSettings)()

    For Each filterId As ElementId In view.GetFilters()
        Dim overrideSettings As OverrideGraphicSettings = view.GetFilterOverrides(filterId)

        Dim lineColor As Color = overrideSettings.CutLineColor

        If lineColor.IsValid = False Then
            Continue For
        End If

        ' Save overrides setting the cut color to green
        If lineColor.Red = &Hff AndAlso lineColor.Green = &H0 AndAlso lineColor.Blue = &H0 Then
            overrideSettings.SetCutLineColor(New Color(&H0, &Hff, &H0))
            filterIdsToChange(filterId) = overrideSettings
        End If
    Next

    ' Make the change to all found filters
    Using t As New Transaction(doc, "Change override filters")
        t.Start()

        For Each filterId As ElementId In filterIdsToChange.Keys
            view.SetFilterOverrides(filterId, filterIdsToChange(filterId))
        Next
        t.Commit()
    End Using
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | ElementId is not associated with a FilterElement. -or- Fill pattern must be a drafting pattern. -or- Fill pattern Id must be invalidElementId or point to a LinePattern element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### Position Property

---

|  |
| --- |
| ReferencePoint Class   See Also |

The position of the ReferencePoint.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Position { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Position As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Position { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

This is an alternate interface to the property CoordinateSystem.Origin. When set, the effect is the same as setting the CoordinateSystem property to the same as its current value but with a different Origin.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when CoordinateSystem is set while the Reference property is not    a null reference (  Nothing  in Visual Basic)  , and the ReferencePoint is unable to move to the new location. |

# See Also

ReferencePoint Class

Autodesk.Revit.DB Namespace

#### NumberOfSections Property

---

|  |
| --- |
| TableData Class   See Also |

Gets the number of items in section data array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int NumberOfSections { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumberOfSections As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int NumberOfSections { 	int get (); } ``` |

# See Also

TableData Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ViewDisplaySketchyLines Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ViewDisplaySketchyLines Class

Autodesk.Revit.DB Namespace

#### LevelDeletedSameName Property

---

|  |
| --- |
| BuiltInFailures CopyMonitorFailures Class   See Also |

Level cannot be copied because level with desired name '[Name]' already exist in a target document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LevelDeletedSameName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LevelDeletedSameName As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LevelDeletedSameName { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyMonitorFailures Class

Autodesk.Revit.DB Namespace

#### DetachFromCentralOption Enumeration

---

|  |
| --- |
| See Also |

Options for workset detachment behavior.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum DetachFromCentralOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DetachFromCentralOption ``` |

| Visual C++ |
| --- |
| ``` public enum class DetachFromCentralOption ``` |

# Members

| Member name | Description |
| --- | --- |
| DoNotDetach | Do not detach the file being opened from its central file. |
| DetachAndPreserveWorksets | Detach the file being opened from its central file. |
| DetachAndDiscardWorksets | Detach the model being opened from its central model and discard worksets/worksharing. |
| ClearTransmittedSaveAsNewCentral | After opening the transmitted, workshared model, immediately resave it with its current name and clear the transmitted flag. |

# See Also

Autodesk.Revit.DB Namespace

#### GetLeader Method

---

|  |
| --- |
| DatumPlane Class   See Also |

Gets a copy of the leader applied to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public Leader GetLeader( 	DatumEnds datumEnd, 	View view ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLeader ( _ 	datumEnd As DatumEnds, _ 	view As View _ ) As Leader ``` |

| Visual C++ |
| --- |
| ``` public: Leader^ GetLeader( 	DatumEnds datumEnd,  	View^ view ) ``` |

#### Parameters

datumEnd
:   Type:  Autodesk.Revit.DB DatumEnds
     The end of the datum plane.

view
:   Type:  Autodesk.Revit.DB View
     The view on which the DatumPlane shows.

#### Return Value

The Leader of the datum plane. Null will return if no leader applied.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The datum plane cannot be visible in the view. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | This datum plane has no leaders. |

# See Also

DatumPlane Class

Autodesk.Revit.DB Namespace

#### FabricationProductDataSpecification Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Product Specification Description"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationProductDataSpecification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationProductDataSpecification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationProductDataSpecification { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Selection Property

---

|  |
| --- |
| UIDocument Class   See Also |

Retrieve the currently selected Elements in Autodesk Revit.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Selection Selection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Selection As Selection 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Selection^ Selection { 	Selection^ get (); } ``` |

# Remarks

Returns an object that represents the active selection. The Selection property returns an object that represents the active selection when the command was started.

# See Also

UIDocument Class

Autodesk.Revit.UI Namespace

#### StructuralBeamEndAttachmentType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Attachment Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralBeamEndAttachmentType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralBeamEndAttachmentType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralBeamEndAttachmentType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarSystemCoverSide Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Rebar Cover Side/Edge"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemCoverSide { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemCoverSide As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemCoverSide { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HasInvalidKey Method

---

|  |
| --- |
| ClassificationEntry Class   See Also |

Checks if the key matches the level and parent key.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool HasInvalidKey() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasInvalidKey As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasInvalidKey() ``` |

#### Return Value

True if the key doesn't matach the level and parent key. False otherwise.

# See Also

ClassificationEntry Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| FabricationVersionInfo Class   See Also |

Releases all resources used by the  FabricationVersionInfo

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

FabricationVersionInfo Class

Autodesk.Revit.DB Namespace

#### DisplayReferenceCurves Property

---

|  |
| --- |
| DividedPath Class   See Also |

Controls whether the curves in the path are visible

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool DisplayReferenceCurves { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DisplayReferenceCurves As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool DisplayReferenceCurves { 	bool get (); 	void set (bool value); } ``` |

# Remarks

If true the references that represent the curves will not be hidden. If false the references that represent the curves may be hidden Only references that are curve elements can be hidden If multiple divided paths reference a curve element then the curve element is not hidden unless all divided paths request that it be hidden.

# See Also

DividedPath Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.SlabFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about Slab.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class SlabFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class SlabFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class SlabFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures SlabFailures

# See Also

BuiltInFailures SlabFailures Members

Autodesk.Revit.DB Namespace

#### RailSupportJustification Enumeration

---

|  |
| --- |
| See Also |

The justification of the rail supports.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailSupportJustification ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailSupportJustification ``` |

| Visual C++ |
| --- |
| ``` public enum class RailSupportJustification ``` |

# Members

| Member name | Description |
| --- | --- |
| Begin | Supports are justified to the beginning of the rail. |
| Center | Supports are justified to the center of the rail. |
| End | Supports are justified to the end of the rail. |

# See Also

Autodesk.Revit.DB.Architecture Namespace

#### LoadedApplications Property

---

|  |
| --- |
| UIApplication Class   See Also |

Returns an array of successfully loaded external applications.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual ExternalApplicationArray LoadedApplications { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property LoadedApplications As ExternalApplicationArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property ExternalApplicationArray^ LoadedApplications { 	ExternalApplicationArray^ get (); } ``` |

# Remarks

This property can be used by your application to find all successfully loaded external applications when Revit starts.

# See Also

UIApplication Class

Autodesk.Revit.UI Namespace

#### DesignOptionCannotReference Property

---

|  |
| --- |
| BuiltInFailures AutoJoinFailures Class   See Also |

Design Option ' [Name] ' cannot reference Design Option ' [Name] '.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DesignOptionCannotReference { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DesignOptionCannotReference As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DesignOptionCannotReference { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoJoinFailures Class

Autodesk.Revit.DB Namespace

#### GetZoneEquipmentData Method

---

|  |
| --- |
| ZoneEquipment Class   See Also |

Gets the zone equipment data.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public ZoneEquipmentData GetZoneEquipmentData() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetZoneEquipmentData As ZoneEquipmentData ``` |

| Visual C++ |
| --- |
| ``` public: ZoneEquipmentData^ GetZoneEquipmentData() ``` |

# See Also

ZoneEquipment Class

Autodesk.Revit.DB.Mechanical Namespace

#### IsAllowedTagType Method

---

|  |
| --- |
| MultiReferenceAnnotationType Class   See Also |

Checks if the tag type can be assigned to this multi-reference annotation type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsAllowedTagType( 	ElementId tagTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsAllowedTagType ( _ 	tagTypeId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsAllowedTagType( 	ElementId^ tagTypeId ) ``` |

#### Parameters

tagTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The tag type to test.

#### Return Value

True if the tag type exclusively tags elements from the multi-reference annotation's reference category.

# Remarks

Only tag types which exclusively tag elements from the multi-reference annotation's reference category can be used.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MultiReferenceAnnotationType Class

Autodesk.Revit.DB Namespace

#### InstanceNode Class

---

|  |
| --- |
| Members   See Also |

An output node that represents an instance of a geometry. It can be an instance of FamilyInstance, or it can be and instance of a part of symbol's geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class InstanceNode : GroupNode ``` |

| Visual Basic |
| --- |
| ``` Public Class InstanceNode _ 	Inherits GroupNode ``` |

| Visual C++ |
| --- |
| ``` public ref class InstanceNode : public GroupNode ``` |

# Remarks

See also:  OnInstanceBegin(InstanceNode)  . The  SymbolGeometryId  . contains the data for comparing if two InstanceNode points to the same geometry.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB RenderNode
  Autodesk.Revit.DB GroupNode
  Autodesk.Revit.DB InstanceNode

# See Also

InstanceNode Members

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| SpatialElementGeometryResults Class   See Also |

Releases all resources used by the  SpatialElementGeometryResults

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

SpatialElementGeometryResults Class

Autodesk.Revit.DB Namespace

#### CurtainGrids Property

---

|  |
| --- |
| FootPrintRoof Class   See Also |

Retrieve all the CurtainGrid objects of a FootPrintRoof.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurtainGridSet CurtainGrids { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CurtainGrids As CurtainGridSet 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property CurtainGridSet^ CurtainGrids { 	CurtainGridSet^ get (); } ``` |

# Remarks

Only applicable when the object is a Curtain FootPrintRoof.

# See Also

FootPrintRoof Class

Autodesk.Revit.DB Namespace

#### GroupChangeNoPlaceElements Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Elements cannot be placed as a result of changes to groups.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId GroupChangeNoPlaceElements { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GroupChangeNoPlaceElements As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ GroupChangeNoPlaceElements { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### Equality Operator

---

|  |
| --- |
| ExternalServiceId Class   See Also |

Compares two ExternalServiceId instances.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool operator ==( 	ExternalServiceId first, 	ExternalServiceId second ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Operator = ( _ 	first As ExternalServiceId, _ 	second As ExternalServiceId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool operator ==( 	ExternalServiceId^ first,  	ExternalServiceId^ second ) ``` |

#### Parameters

first
:   Type:  Autodesk.Revit.DB.ExternalService ExternalServiceId
     The first ExternalServiceId.

second
:   Type:  Autodesk.Revit.DB.ExternalService ExternalServiceId
     The second ExternalServiceId.

#### Return Value

True if the inputs are identical, false if they are different.

# See Also

ExternalServiceId Class

Autodesk.Revit.DB.ExternalService Namespace

#### GetPlane Method

---

|  |
| --- |
| HostObjectSubcomponentInfo Class   See Also |

Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public Plane GetPlane() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPlane As Plane ``` |

| Visual C++ |
| --- |
| ``` public: Plane^ GetPlane() ``` |

#### Return Value

The plane.

# See Also

HostObjectSubcomponentInfo Class

Autodesk.Revit.DB.IFC Namespace

#### GetPreferredConstraintOnHandle Method

---

|  |
| --- |
| RebarConstraintsManager Class   See Also |

For ShapeDriven: Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.

For FreeForm: Returns the RebarConstraint that acts on the specified RebarConstraintHandle.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public RebarConstraint GetPreferredConstraintOnHandle( 	RebarConstrainedHandle handle ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPreferredConstraintOnHandle ( _ 	handle As RebarConstrainedHandle _ ) As RebarConstraint ``` |

| Visual C++ |
| --- |
| ``` public: RebarConstraint^ GetPreferredConstraintOnHandle( 	RebarConstrainedHandle^ handle ) ``` |

#### Parameters

handle
:   Type:  Autodesk.Revit.DB.Structure RebarConstrainedHandle
     The RebarConstrainedHandle for which the RebarConstraint is to be returned.

#### Return Value

The user preferred RebarConstraint applied to the RebarConstrainedHandle.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | handle is no longer valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The RebarConstraintsManager does not manage a valid Rebar element. |

# See Also

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace

#### MoveNext Method

---

|  |
| --- |
| MacroManagerIterator Class   See Also |

Increments the iterator to the next item.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool MoveNext() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function MoveNext As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool MoveNext() ``` |

#### Return Value

True if there is a next available item in this iterator. False if the iterator has completed all available items.

# See Also

MacroManagerIterator Class

Autodesk.Revit.DB.Macros Namespace

#### CompoundStructureLayer Constructor

---

|  |
| --- |
| CompoundStructureLayer Class   See Also |

Creates a compound structure layer using default settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CompoundStructureLayer() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: CompoundStructureLayer() ``` |

# Remarks

Note that the combination of the default values does not create a completely valid CompoundStructureLayer. You should change the necessary values before adding to a CompoundStructure.

# See Also

CompoundStructureLayer Class

CompoundStructureLayer Overload

Autodesk.Revit.DB Namespace

#### LoadAttrLinearForceScaleFactor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Linear force scale"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadAttrLinearForceScaleFactor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadAttrLinearForceScaleFactor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadAttrLinearForceScaleFactor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DatumPlaneDefinesOrigin Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Defines Origin"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DatumPlaneDefinesOrigin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DatumPlaneDefinesOrigin As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DatumPlaneDefinesOrigin { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetCalculatedDimensionValue Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Gets the calculated dimension value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public string GetCalculatedDimensionValue( 	FabricationDimensionDefinition dim ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCalculatedDimensionValue ( _ 	dim As FabricationDimensionDefinition _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetCalculatedDimensionValue( 	FabricationDimensionDefinition^ dim ) ``` |

#### Parameters

dim
:   Type:  Autodesk.Revit.DB FabricationDimensionDefinition
     The fabrication dimension.

#### Return Value

The calculated dimension value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### ConnectorDomainType Enumeration

---

|  |
| --- |
| See Also |

Type of connector domain.

Enumeration of connector domain types

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ConnectorDomainType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ConnectorDomainType ``` |

| Visual C++ |
| --- |
| ``` public enum class ConnectorDomainType ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | Domain is undefined |
| Hvac | HVAC (duct) connector |
| Electrical | Electrical connector |
| Piping | Piping connector |
| CableTrayConduit | Connector of cable trays or conduits |
| StructuralAnalytical | Connector of Structural Analytical Model |

# See Also

Autodesk.Revit.DB Namespace

#### IsValidFieldId Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Checks whether a ScheduleFieldId is the ID of a field in this ScheduleDefinition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsValidFieldId( 	ScheduleFieldId fieldId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidFieldId ( _ 	fieldId As ScheduleFieldId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidFieldId( 	ScheduleFieldId^ fieldId ) ``` |

#### Parameters

fieldId
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The field ID to check.

#### Return Value

True if the field ID is valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### Flip Method

---

|  |
| --- |
| Wall Class   See Also |

The wall orientation will be flipped.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Flip() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Flip ``` |

| Visual C++ |
| --- |
| ``` public: void Flip() ``` |

# See Also

Wall Class

Autodesk.Revit.DB Namespace

#### IsSplit Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

Checks if the schedule is split.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public bool IsSplit() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsSplit As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsSplit() ``` |

#### Return Value

True if the schedule is split. Otherwise false.

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### CurrentObject Property

---

|  |
| --- |
| FilteredWorksetIterator Class   See Also |

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` internal Object CurrentObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Friend ReadOnly Property CurrentObject As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` internal: virtual property Object^ CurrentObject { 	Object^ get () sealed; } ``` |

#### Implements

 IEnumerator Current

# See Also

FilteredWorksetIterator Class

Autodesk.Revit.DB Namespace

#### FormElemRegenFailureError Property

---

|  |
| --- |
| BuiltInFailures FormFailures Class   See Also |

Unable to create form element

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FormElemRegenFailureError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FormElemRegenFailureError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FormElemRegenFailureError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FormFailures Class

Autodesk.Revit.DB Namespace

#### DimLeaderShoulderLength Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shoulder Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimLeaderShoulderLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimLeaderShoulderLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimLeaderShoulderLength { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralElevationAtTopCore Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elevation at Top Core"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralElevationAtTopCore { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralElevationAtTopCore As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralElevationAtTopCore { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetFormula Method

---

|  |
| --- |
| GlobalParameter Class   See Also |

Returns the parameter's expression in form of a string.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public string GetFormula() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFormula As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetFormula() ``` |

#### Return Value

The string representing the expression assigned to the parameter.

# Remarks

Returns an empty string a case the parameter is not determined by a formula, or if the the expression cannot be converted to a string.

# See Also

GlobalParameter Class

Autodesk.Revit.DB Namespace

#### SpacePowerScheduleParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Power Schedule"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacePowerScheduleParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacePowerScheduleParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacePowerScheduleParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarVaryingLengthNumberSuffix Property

---

|  |
| --- |
| ReinforcementSettings Class   See Also |

A unique identifier used for a bar within a variable length rebar set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string RebarVaryingLengthNumberSuffix { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RebarVaryingLengthNumberSuffix As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ RebarVaryingLengthNumberSuffix { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

This property affects only Rebar sets under the following conditions:

* 1. The distribution type (  [!:Autodesk::Revit::DB::Rebar::distributionType]  ) of the Rebar is DistributionType::Enum::VaryingLength.
* 2. There are at least two bars within the Rebar set that have different shape parameter values (i.e at least two bars vary in length).

*The shape parameters of a Rebar can be accessed via  [!:Autodesk::Revit::DB::Structure::RebarShapeDefinition::getParameters]  method.*

*The parameters at a specific index in a Rebar set can be accessed via  [!:Autodesk::Revit::DB::Structure::Rebar::getParameterValueAtIndex]  method.*

This property is assigned to varying Rebar sets only if they are numbered as a whole (i.e.  NumberVaryingLengthRebarsIndividually  is set to false).

The values for this property are valid if :

* Input contains at least one character.
* Input contains either alphabetical or numeric characters (not both).

When this property is used, each bar in a varying set will be assigned an incremented value of the suffix. As an example, the suffix values for three bars in a varying set are:

* For alphabetic suffix : Aaz -> Aba -> Abb.
* For numeric suffix : 129 -> 130 -> 131.

These values are automatically incremented by the system.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The rebar number suffix is not valid if :  * Input is empty. * Input contains non-alphanumeric characters. * Input contains both numeric and alphabetic characters. * Input is a value that exceeds the maximum integer representation. * Input contains more than 6 alphabetic characters. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

ReinforcementSettings Class

Autodesk.Revit.DB.Structure Namespace

#### BasepointAngletonParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Angle to True North"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BasepointAngletonParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BasepointAngletonParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BasepointAngletonParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralConnectionForbiddenElementInGroup Property

---

|  |
| --- |
| BuiltInFailures StructuralConnectionFailures Class   See Also |

Fabrication element can not be a group member.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StructuralConnectionForbiddenElementInGroup { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralConnectionForbiddenElementInGroup As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StructuralConnectionForbiddenElementInGroup { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StructuralConnectionFailures Class

Autodesk.Revit.DB Namespace

#### FamilyPath Property

---

|  |
| --- |
| FamilyLoadedIntoDocumentEventArgs Class   See Also |

The file path of the family that is loaded into the document.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public string FamilyPath { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FamilyPath As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ FamilyPath { 	String^ get (); } ``` |

# See Also

FamilyLoadedIntoDocumentEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### Dispose Method

---

|  |
| --- |
| AssemblyDifference Class   See Also |

Releases all resources used by the  AssemblyDifference

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

AssemblyDifference Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| PaperSizeSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

PaperSizeSetIterator Class

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| DoubleArray Class   See Also |

Returns the number of doubles that are in the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

DoubleArray Class

Autodesk.Revit.DB Namespace

#### Multiply Operator (Double, XYZ)

---

|  |
| --- |
| XYZ Class   See Also |

Multiplies the specified number and the specified vector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static XYZ operator *( 	double value, 	XYZ right ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Operator * ( _ 	value As Double, _ 	right As XYZ _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: static XYZ^ operator *( 	double value,  	XYZ^ right ) ``` |

#### Parameters

value
:   Type:  System Double
     The value to multiply with the specified vector.

right
:   Type:  Autodesk.Revit.DB XYZ
     The vector to multiply with the value.

#### Return Value

The multiplied vector.

# Remarks

The multiplied vector is obtained by multiplying each coordinate of the specified vector by the specified value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when right is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the specified value is an infinite number. |

# See Also

XYZ Class

Multiply Overload

Autodesk.Revit.DB Namespace

#### ZoneElementDomainData Class

---

|  |
| --- |
| Members   See Also |

A base class for specific domain requirements for a zone.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public class ZoneElementDomainData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ZoneElementDomainData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ZoneElementDomainData : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Mechanical ZoneElementDomainData
  Autodesk.Revit.DB.Electrical AreaBasedLoadData

# See Also

ZoneElementDomainData Members

Autodesk.Revit.DB.Mechanical Namespace

#### BrowserOrganization Class

---

|  |
| --- |
| Members   See Also |

The organization settings for grouping, sorting, and filtering of items in the project browser.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class BrowserOrganization : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class BrowserOrganization _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class BrowserOrganization : public ElementType ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB BrowserOrganization

# See Also

BrowserOrganization Members

Autodesk.Revit.DB Namespace

#### GetSeverity Method

---

|  |
| --- |
| FailureMessageAccessor Class   See Also |

Retrieves the severity of the failure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureSeverity GetSeverity() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSeverity As FailureSeverity ``` |

| Visual C++ |
| --- |
| ``` public: FailureSeverity GetSeverity() ``` |

#### Return Value

The severity of the failure.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace

#### RebarShapeSegment Class

---

|  |
| --- |
| Members   See Also |

Part of a RebarShapeDefinitionBySegments, representing one segment of a shape definition. Makes sure constraints of type RebarShapeConstraintFixedSegmentDir are uniquely set. If we try to aquire a second constraint of type RebarShapeConstraintFixedSegmentDir we delete the old one.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class RebarShapeSegment : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class RebarShapeSegment _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class RebarShapeSegment : IDisposable ``` |

# Remarks

Each segment must have enough constraints to determine its position. Overconstraining is allowed. The most common combinations are:

* A fixed direction together with a parallel length constraint;
* A parallel length constraint plus another length constraint parallel to the x-axis or y-axis;
* A parallel length constraint plus length constraints parallel to both the x-axis and y-axis.

Multiple constraints may be driven by the same parameter, even on the same segment.

Length constraints may be measured in two ways. For "measured to the outside of the bend," the reference is a tangent to the exterior face of the bar; the thickness of the bar is included. For "measured to the inside," the reference is the center of the arc of the bend; this is the point where the bend begins, if the constraint is parallel to the segment.

A 180-degree bend is described by introducing a short segment in between the two straight segments, tangent to the midpoint of the bend.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure RebarShapeSegment

# See Also

RebarShapeSegment Members

Autodesk.Revit.DB.Structure Namespace

#### ZoneCalculatedHeatingLoadParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Calculated Heating Load"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ZoneCalculatedHeatingLoadParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ZoneCalculatedHeatingLoadParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ZoneCalculatedHeatingLoadParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InaccurateCurveBasedFamily Property

---

|  |
| --- |
| BuiltInFailures InaccurateFailures Class   See Also |

Curve-Based Family is slightly off axis and may cause inaccuracies.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InaccurateCurveBasedFamily { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InaccurateCurveBasedFamily As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InaccurateCurveBasedFamily { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures InaccurateFailures Class

Autodesk.Revit.DB Namespace

#### PointCloudFoundStatus Enumeration

---

|  |
| --- |
| See Also |

Enumerated type representing the possible states related to searching for a point cloud file.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum PointCloudFoundStatus ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PointCloudFoundStatus ``` |

| Visual C++ |
| --- |
| ``` public enum class PointCloudFoundStatus ``` |

# Members

| Member name | Description |
| --- | --- |
| Unknown | Initial state. Loading of the Point Cloud hasn't been attempted. |
| NotFound | File-based Point Cloud cannot be located and hence can't be loaded. |
| FoundOK | File-based Point Cloud has been located and can be loaded. |

# See Also

Autodesk.Revit.DB Namespace

#### FoundStatus Property

---

|  |
| --- |
| PointCloudType Class   See Also |

Shows whether the Point Cloud external file could be found.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public PointCloudFoundStatus FoundStatus { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FoundStatus As PointCloudFoundStatus 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property PointCloudFoundStatus FoundStatus { 	PointCloudFoundStatus get (); } ``` |

# See Also

PointCloudType Class

Autodesk.Revit.DB Namespace

#### VerificationText Property

---

|  |
| --- |
| TaskDialog Class   See Also |

VerificationText is used to label the verification checkbox.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string VerificationText { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property VerificationText As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ VerificationText { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

Thrown if the TaskDialog has already enabled the Do not show message as the two cannot coincide in the same TaskDialog. If VerificationText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasVerificationChecked() method.

# See Also

TaskDialog Class

Autodesk.Revit.UI Namespace

#### HostId Property

---

|  |
| --- |
| Railing Class   See Also |

The host of the railing.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId HostId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property HostId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ HostId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

If the host will be a Stairs in  MultistoryStairs  element, use  [M:Autodesk.Revit.DB.Architecture.Railing.SetMultistoryStairsPlacementLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})]  to set the base levels of the stairs where the railing should be placed.

If %hostId% is the id of a Stairs Component (Run or Landing), it means that the Railing will be hosted by the Stairs element but railing adjustment to the stairs will start from the Component. If a stairs id is set as a host, the lowest stairs component below or above the railing sketch will be chosen as the host instead.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The hostId is not a valid railing host. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

Railing Class

Autodesk.Revit.DB.Architecture Namespace

#### RebarSystemLayerSummaryTopDir1NoSpacing Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top/Exterior Major (Brief)"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemLayerSummaryTopDir1NoSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemLayerSummaryTopDir1NoSpacing As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemLayerSummaryTopDir1NoSpacing { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetHashCode Method

---

|  |
| --- |
| ExternalGeometryId Class   See Also |

Gets the hash code.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public override int GetHashCode() ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Function GetHashCode As Integer ``` |

| Visual C++ |
| --- |
| ``` public: virtual int GetHashCode() override ``` |

# See Also

ExternalGeometryId Class

Autodesk.Revit.DB Namespace

#### MoveLine Method

---

|  |
| --- |
| AreaReinforcement Class   See Also |

This method applies the translation to the line from the desired layer, at the specified position. If the line was already moved, the method will concatenate the translation with the existing movement. The line will be translated only along the direction of the specified layer.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void MoveLine( 	XYZ translation, 	AreaReinforcementLayerType layer, 	int linePositionIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub MoveLine ( _ 	translation As XYZ, _ 	layer As AreaReinforcementLayerType, _ 	linePositionIndex As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void MoveLine( 	XYZ^ translation,  	AreaReinforcementLayerType layer,  	int linePositionIndex ) ``` |

#### Parameters

translation
:   Type:  Autodesk.Revit.DB XYZ
     The translation vector.

layer
:   Type:  Autodesk.Revit.DB.Structure AreaReinforcementLayerType
     The layer on which the line stays.

linePositionIndex
:   Type:  System Int32
     The index of the line from the desired layer. It should be an index between 0 and (NumberOfLines-1).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | linePositionIndex is not in the range [ 0, NumberOfLines-1 ]. -or- A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | The layer layer isn't active. |
| Autodesk.Revit.Exceptions InvalidOperationException | This AreaReinforcement does not host Rebar. |

# See Also

AreaReinforcement Class

Autodesk.Revit.DB.Structure Namespace

#### ForwardIterator Method

---

|  |
| --- |
| PaperSizeSet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual PaperSizeSetIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As PaperSizeSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual PaperSizeSetIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

# See Also

PaperSizeSet Class

Autodesk.Revit.DB Namespace

#### VisGraphicsAnalyticalModel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"V/G Overrides Analytical Model"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId VisGraphicsAnalyticalModel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property VisGraphicsAnalyticalModel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ VisGraphicsAnalyticalModel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ForwardIterator Method

---

|  |
| --- |
| CurveArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual CurveArrayIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As CurveArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual CurveArrayIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

# See Also

CurveArray Class

Autodesk.Revit.DB Namespace

#### MinimumYieldStress Property

---

|  |
| --- |
| StructuralAsset Class   See Also |

The minimum yield stress of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double MinimumYieldStress { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MinimumYieldStress As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double MinimumYieldStress { 	double get (); 	void set (double value); } ``` |

# Remarks

Applies to Metal-based and generic structural assets. The value is in Newtons per foot meter (N/(ft Â· m)).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InapplicableDataException | When setting this property: the material type must be Metal or generic to set this property. |

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace

#### NoSupportKCoefficientTable Property

---

|  |
| --- |
| BuiltInFailures ConnectorFailures Class   See Also |

"K Coefficient from table" is not supported on connector for the element

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoSupportKCoefficientTable { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoSupportKCoefficientTable As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoSupportKCoefficientTable { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ConnectorFailures Class

Autodesk.Revit.DB Namespace

#### SystemEquipmentSets Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Equipment Sets"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SystemEquipmentSets { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SystemEquipmentSets As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SystemEquipmentSets { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### OverrideServiceButtonExclusion Method

---

|  |
| --- |
| FabricationService Class   See Also |

Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public void OverrideServiceButtonExclusion( 	int paletteIndex, 	int buttonIndex, 	bool exclude ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub OverrideServiceButtonExclusion ( _ 	paletteIndex As Integer, _ 	buttonIndex As Integer, _ 	exclude As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void OverrideServiceButtonExclusion( 	int paletteIndex,  	int buttonIndex,  	bool exclude ) ``` |

#### Parameters

paletteIndex
:   Type:  System Int32
     The index of the service palette to exclude the service button from.

buttonIndex
:   Type:  System Int32
     The index of the service button to exclude.

exclude
:   Type:  System Boolean
     Pass true to exclude from being used by Route and Fill or Design to Fabrication.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index paletteIndex is not larger or equal to 0 and less than PaletteCount |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

FabricationService Class

Autodesk.Revit.DB Namespace

#### Item Property

---

|  |
| --- |
| CombinableElementArray Class   See Also |

Gets or sets a CombinableElement at a specified index within the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual CombinableElement this[ 	int index ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property Item ( _ 	index As Integer _ ) As CombinableElement 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property CombinableElement^ Item[int index] { 	CombinableElement^ get (int index); 	void set (int index, CombinableElement^ value); } ``` |

#### Parameters

index
:   Type:  System Int32
     The index of the CombinableElement to be set or retrieved.

#### Return Value

Returns the CombinableElement at the specified index.

# See Also

CombinableElementArray Class

Autodesk.Revit.DB Namespace

#### LayoutRuleFixedNumber Class

---

|  |
| --- |
| Members   Example   See Also |

This class indicate the layout rule of a Beam System is Fixed-Number.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class LayoutRuleFixedNumber : LayoutRule ``` |

| Visual Basic |
| --- |
| ``` Public Class LayoutRuleFixedNumber _ 	Inherits LayoutRule ``` |

| Visual C++ |
| --- |
| ``` public ref class LayoutRuleFixedNumber : public LayoutRule ``` |

# Remarks

To use this type of LayoutRule, only the number of the beams must be set.

# Examples

 Copy  C#

```
private bool LayoutRuleFixedNumberInformation(BeamSystem beamSystem)
{
    //get the layoutRule of the beamsystem
    Autodesk.Revit.DB.LayoutRule layoutRule = beamSystem.LayoutRule;

    string message = "BeamSystem layout rule : " + layoutRule;

    //create a new instance of the LayoutRuleClearSpacing class
    LayoutRuleFixedNumber myLayoutRuleFixedNumber =
                        new LayoutRuleFixedNumber(8);

    //set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleFixedNumber;

    LayoutRuleFixedNumber fixedNumber = beamSystem.LayoutRule as LayoutRuleFixedNumber;

    if (null == fixedNumber)
    {
        return false;
    }
    //try to get the property value of the beamsystem LayoutRule
    int numberOfLines = fixedNumber.NumberOfLines;

    message += "\nNew BeamSystem layout rule: " + fixedNumber;
    message += "\nNew BeamSystem number of beams: " + numberOfLines;

    TaskDialog.Show("Revit",message);

    return true;
}
```

 Copy  VB.NET

```
Private Function LayoutRuleFixedNumberInformation(beamSystem As BeamSystem) As Boolean
    'get the layoutRule of the beamsystem
    Dim layoutRule As Autodesk.Revit.DB.LayoutRule = beamSystem.LayoutRule

    Dim message As String = "BeamSystem layout rule : " & layoutRule.ToString()

    'create a new instance of the LayoutRuleClearSpacing class
    Dim myLayoutRuleFixedNumber As New LayoutRuleFixedNumber(8)

    'set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleFixedNumber

    Dim fixedNumber As LayoutRuleFixedNumber = TryCast(beamSystem.LayoutRule, LayoutRuleFixedNumber)

    If fixedNumber Is Nothing Then
        Return False
    End If
    'try to get the property value of the beamsystem LayoutRule
    Dim numberOfLines As Integer = fixedNumber.NumberOfLines

    message += vbLf & "New BeamSystem layout rule: " & fixedNumber.ToString()
    message += vbLf & "New BeamSystem number of beams: " & numberOfLines

    TaskDialog.Show("Revit", message)

    Return True
End Function
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB LayoutRule
  Autodesk.Revit.DB LayoutRuleFixedNumber

# See Also

LayoutRuleFixedNumber Members

Autodesk.Revit.DB Namespace